def @main(%input_ids: Tensor[(1, 128), int64], %token_type_ids: Tensor[(1, 128), int64], %attention_mask: Tensor[(1, 128), int64], param_virtual_devices=[VirtualDevice(device_type=1, virtual_device_id=0, target=Target(kind='llvm', keys={'cpu'}, attrs={'link-params': (bool)0}, host=Target(kind='llvm', keys={'cpu'}, attrs={'link-params': (bool)0}))), VirtualDevice(device_type=1, virtual_device_id=0, target=Target(kind='llvm', keys={'cpu'}, attrs={'link-params': (bool)0}, host=Target(kind='llvm', keys={'cpu'}, attrs={'link-params': (bool)0}))), VirtualDevice(device_type=1, virtual_device_id=0, target=Target(kind='llvm', keys={'cpu'}, attrs={'link-params': (bool)0}, host=Target(kind='llvm', keys={'cpu'}, attrs={'link-params': (bool)0})))], result_virtual_device=VirtualDevice(device_type=1, virtual_device_id=0, target=Target(kind='llvm', keys={'cpu'}, attrs={'link-params': (bool)0}, host=Target(kind='llvm', keys={'cpu'}, attrs={'link-params': (bool)0}))), hash="20dcb01b8dc5eaff", weight_layout="NC8n") -> (Tensor[(1, 128, 768), float32], Tensor[(1, 768), float32]) {
  %383 = cast(%input_ids, dtype="int32") /* ty=Tensor[(1, 128), int32] */;
  %384 = cast(%token_type_ids, dtype="int32") /* ty=Tensor[(1, 128), int32] */;
  %385 = take(meta[relay.Constant][156] /* ty=Tensor[(30522, 768), float32] */, %383, axis=0) /* ty=Tensor[(1, 128, 768), float32] */;
  %386 = take(meta[relay.Constant][157] /* ty=Tensor[(2, 768), float32] */, %384, axis=0) /* ty=Tensor[(1, 128, 768), float32] */;
  %387 = add(%385, %386) /* ty=Tensor[(1, 128, 768), float32] */;
  %388 = add(%387, meta[relay.Constant][158] /* ty=Tensor[(1, 128, 768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
  %389 = nn.layer_norm(%388, meta[relay.Constant][159] /* ty=Tensor[(768), float32] */, meta[relay.Constant][160] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 128, 768), float32] */;
  %390 = reshape(%389, newshape=[-1, 768]) /* ty=Tensor[(128, 768), float32] */;
  %391 = fn (%p083: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %378 = nn.contrib_dense_pack(%p083, meta[relay.Constant][154] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %379 = reshape(%378, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %380 = add(%379, meta[relay.Constant][155] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %381 = reshape(%380, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %382 = transpose(%381, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%382, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %397 = fn (%p084: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %392 = nn.contrib_dense_pack(%p084, meta[relay.Constant][161] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %393 = reshape(%392, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %394 = add(%393, meta[relay.Constant][162] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %395 = reshape(%394, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %396 = transpose(%395, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%396, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %398 = %391(%390) /* ty=Tensor[(12, 128, 64), float32] */;
  %399 = %397(%390) /* ty=Tensor[(12, 128, 64), float32] */;
  %400 = fn (%p082: Tensor[(12, 128, 64), float32], %p147: Tensor[(12, 128, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 128), float32] {
    %373 = nn.batch_matmul(%p082, %p147, transpose_b=True) /* ty=Tensor[(12, 128, 128), float32] */;
    %374 = reshape(%373, newshape=[1, 12, 128, 128]) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %375 = add(%374, meta[relay.Constant][153] /* ty=Tensor[(1, 1, 1, 128), float32] */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %376 = divide(%375, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %377 = nn.softmax(%376) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    reshape(%377, newshape=[-1, 128, 128]) /* ty=Tensor[(12, 128, 128), float32] */
  };
  %406 = fn (%p085: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 128), float32] {
    %401 = nn.contrib_dense_pack(%p085, meta[relay.Constant][163] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %402 = reshape(%401, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %403 = add(%402, meta[relay.Constant][164] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %404 = reshape(%403, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %405 = transpose(%404, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 128), float32] */;
    reshape(%405, newshape=[-1, 64, 128]) /* ty=Tensor[(12, 64, 128), float32] */
  };
  %407 = %400(%398, %399) /* ty=Tensor[(12, 128, 128), float32] */;
  %408 = %406(%390) /* ty=Tensor[(12, 64, 128), float32] */;
  %409 = fn (%p081: Tensor[(12, 128, 128), float32], %p146: Tensor[(12, 64, 128), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %370 = nn.batch_matmul(%p081, %p146, transpose_b=True) /* ty=Tensor[(12, 128, 64), float32] */;
    %371 = reshape(%370, newshape=[1, 12, 128, 64]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    %372 = transpose(%371, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    reshape(%372, newshape=[128, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %410 = %409(%407, %408) /* ty=Tensor[(128, 768), float32] */;
  %411 = fn (%p080: Tensor[(128, 768), float32], %p145: Tensor[(1, 128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %365 = nn.contrib_dense_pack(%p080, meta[relay.Constant][149] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %366 = reshape(%365, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %367 = add(%366, meta[relay.Constant][150] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %368 = add(%367, %p145) /* ty=Tensor[(1, 128, 768), float32] */;
    %369 = nn.layer_norm(%368, meta[relay.Constant][151] /* ty=Tensor[(768), float32] */, meta[relay.Constant][152] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 128, 768), float32] */;
    reshape(%369, newshape=[-1, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %412 = %411(%410, %389) /* ty=Tensor[(128, 768), float32] */;
  %413 = fn (%p078: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 3072), float32] {
    %360 = nn.contrib_dense_pack(%p078, meta[relay.Constant][147] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 3072), float32] */;
    %361 = reshape(%360, newshape=[1, 128, 3072]) /* ty=Tensor[(1, 128, 3072), float32] */;
    %362 = add(%361, meta[relay.Constant][148] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 128, 3072), float32] */;
    %363 = fn (%p079: Tensor[(1, 128, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 128, 3072), float32] {
      %356 = multiply(%p079, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 128, 3072), float32] */;
      %357 = erf(%356) /* ty=Tensor[(1, 128, 3072), float32] */;
      %358 = multiply(%357, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 128, 3072), float32] */;
      %359 = add(0.5f /* ty=float32 */, %358) /* ty=Tensor[(1, 128, 3072), float32] */;
      multiply(%p079, %359) /* ty=Tensor[(1, 128, 3072), float32] */
    };
    %364 = %363(%362) /* ty=Tensor[(1, 128, 3072), float32] */;
    reshape(%364, newshape=[-1, 3072]) /* ty=Tensor[(128, 3072), float32] */
  };
  %414 = %413(%412) /* ty=Tensor[(128, 3072), float32] */;
  %415 = fn (%p077: Tensor[(128, 3072), float32], %p144: Tensor[(1, 128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %351 = nn.contrib_dense_pack(%p077, meta[relay.Constant][143] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %352 = reshape(%351, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %353 = add(%352, meta[relay.Constant][144] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %354 = add(%353, %p144) /* ty=Tensor[(1, 128, 768), float32] */;
    %355 = nn.layer_norm(%354, meta[relay.Constant][145] /* ty=Tensor[(768), float32] */, meta[relay.Constant][146] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 128, 768), float32] */;
    reshape(%355, newshape=[-1, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %416 = %415(%414, %369) /* ty=Tensor[(128, 768), float32] */;
  %417 = fn (%p076: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %346 = nn.contrib_dense_pack(%p076, meta[relay.Constant][141] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %347 = reshape(%346, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %348 = add(%347, meta[relay.Constant][142] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %349 = reshape(%348, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %350 = transpose(%349, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%350, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %423 = fn (%p086: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %418 = nn.contrib_dense_pack(%p086, meta[relay.Constant][165] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %419 = reshape(%418, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %420 = add(%419, meta[relay.Constant][166] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %421 = reshape(%420, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %422 = transpose(%421, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%422, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %424 = %417(%416) /* ty=Tensor[(12, 128, 64), float32] */;
  %425 = %423(%416) /* ty=Tensor[(12, 128, 64), float32] */;
  %426 = fn (%p075: Tensor[(12, 128, 64), float32], %p143: Tensor[(12, 128, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 128), float32] {
    %341 = nn.batch_matmul(%p075, %p143, transpose_b=True) /* ty=Tensor[(12, 128, 128), float32] */;
    %342 = reshape(%341, newshape=[1, 12, 128, 128]) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %343 = add(%342, meta[relay.Constant][140] /* ty=Tensor[(1, 1, 1, 128), float32] */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %344 = divide(%343, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %345 = nn.softmax(%344) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    reshape(%345, newshape=[-1, 128, 128]) /* ty=Tensor[(12, 128, 128), float32] */
  };
  %432 = fn (%p087: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 128), float32] {
    %427 = nn.contrib_dense_pack(%p087, meta[relay.Constant][167] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %428 = reshape(%427, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %429 = add(%428, meta[relay.Constant][168] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %430 = reshape(%429, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %431 = transpose(%430, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 128), float32] */;
    reshape(%431, newshape=[-1, 64, 128]) /* ty=Tensor[(12, 64, 128), float32] */
  };
  %433 = %426(%424, %425) /* ty=Tensor[(12, 128, 128), float32] */;
  %434 = %432(%416) /* ty=Tensor[(12, 64, 128), float32] */;
  %435 = fn (%p074: Tensor[(12, 128, 128), float32], %p142: Tensor[(12, 64, 128), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %338 = nn.batch_matmul(%p074, %p142, transpose_b=True) /* ty=Tensor[(12, 128, 64), float32] */;
    %339 = reshape(%338, newshape=[1, 12, 128, 64]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    %340 = transpose(%339, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    reshape(%340, newshape=[128, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %436 = %435(%433, %434) /* ty=Tensor[(128, 768), float32] */;
  %437 = fn (%p073: Tensor[(128, 768), float32], %p141: Tensor[(1, 128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %333 = nn.contrib_dense_pack(%p073, meta[relay.Constant][136] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %334 = reshape(%333, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %335 = add(%334, meta[relay.Constant][137] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %336 = add(%335, %p141) /* ty=Tensor[(1, 128, 768), float32] */;
    %337 = nn.layer_norm(%336, meta[relay.Constant][138] /* ty=Tensor[(768), float32] */, meta[relay.Constant][139] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 128, 768), float32] */;
    reshape(%337, newshape=[-1, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %438 = %437(%436, %355) /* ty=Tensor[(128, 768), float32] */;
  %439 = fn (%p071: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 3072), float32] {
    %328 = nn.contrib_dense_pack(%p071, meta[relay.Constant][134] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 3072), float32] */;
    %329 = reshape(%328, newshape=[1, 128, 3072]) /* ty=Tensor[(1, 128, 3072), float32] */;
    %330 = add(%329, meta[relay.Constant][135] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 128, 3072), float32] */;
    %331 = fn (%p072: Tensor[(1, 128, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 128, 3072), float32] {
      %324 = multiply(%p072, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 128, 3072), float32] */;
      %325 = erf(%324) /* ty=Tensor[(1, 128, 3072), float32] */;
      %326 = multiply(%325, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 128, 3072), float32] */;
      %327 = add(0.5f /* ty=float32 */, %326) /* ty=Tensor[(1, 128, 3072), float32] */;
      multiply(%p072, %327) /* ty=Tensor[(1, 128, 3072), float32] */
    };
    %332 = %331(%330) /* ty=Tensor[(1, 128, 3072), float32] */;
    reshape(%332, newshape=[-1, 3072]) /* ty=Tensor[(128, 3072), float32] */
  };
  %440 = %439(%438) /* ty=Tensor[(128, 3072), float32] */;
  %441 = fn (%p070: Tensor[(128, 3072), float32], %p140: Tensor[(1, 128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %319 = nn.contrib_dense_pack(%p070, meta[relay.Constant][130] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %320 = reshape(%319, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %321 = add(%320, meta[relay.Constant][131] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %322 = add(%321, %p140) /* ty=Tensor[(1, 128, 768), float32] */;
    %323 = nn.layer_norm(%322, meta[relay.Constant][132] /* ty=Tensor[(768), float32] */, meta[relay.Constant][133] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 128, 768), float32] */;
    reshape(%323, newshape=[-1, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %442 = %441(%440, %337) /* ty=Tensor[(128, 768), float32] */;
  %443 = fn (%p069: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %314 = nn.contrib_dense_pack(%p069, meta[relay.Constant][128] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %315 = reshape(%314, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %316 = add(%315, meta[relay.Constant][129] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %317 = reshape(%316, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %318 = transpose(%317, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%318, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %449 = fn (%p088: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %444 = nn.contrib_dense_pack(%p088, meta[relay.Constant][169] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %445 = reshape(%444, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %446 = add(%445, meta[relay.Constant][170] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %447 = reshape(%446, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %448 = transpose(%447, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%448, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %450 = %443(%442) /* ty=Tensor[(12, 128, 64), float32] */;
  %451 = %449(%442) /* ty=Tensor[(12, 128, 64), float32] */;
  %452 = fn (%p068: Tensor[(12, 128, 64), float32], %p139: Tensor[(12, 128, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 128), float32] {
    %309 = nn.batch_matmul(%p068, %p139, transpose_b=True) /* ty=Tensor[(12, 128, 128), float32] */;
    %310 = reshape(%309, newshape=[1, 12, 128, 128]) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %311 = add(%310, meta[relay.Constant][127] /* ty=Tensor[(1, 1, 1, 128), float32] */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %312 = divide(%311, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %313 = nn.softmax(%312) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    reshape(%313, newshape=[-1, 128, 128]) /* ty=Tensor[(12, 128, 128), float32] */
  };
  %458 = fn (%p089: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 128), float32] {
    %453 = nn.contrib_dense_pack(%p089, meta[relay.Constant][171] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %454 = reshape(%453, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %455 = add(%454, meta[relay.Constant][172] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %456 = reshape(%455, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %457 = transpose(%456, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 128), float32] */;
    reshape(%457, newshape=[-1, 64, 128]) /* ty=Tensor[(12, 64, 128), float32] */
  };
  %459 = %452(%450, %451) /* ty=Tensor[(12, 128, 128), float32] */;
  %460 = %458(%442) /* ty=Tensor[(12, 64, 128), float32] */;
  %461 = fn (%p067: Tensor[(12, 128, 128), float32], %p138: Tensor[(12, 64, 128), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %306 = nn.batch_matmul(%p067, %p138, transpose_b=True) /* ty=Tensor[(12, 128, 64), float32] */;
    %307 = reshape(%306, newshape=[1, 12, 128, 64]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    %308 = transpose(%307, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    reshape(%308, newshape=[128, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %462 = %461(%459, %460) /* ty=Tensor[(128, 768), float32] */;
  %463 = fn (%p066: Tensor[(128, 768), float32], %p137: Tensor[(1, 128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %301 = nn.contrib_dense_pack(%p066, meta[relay.Constant][123] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %302 = reshape(%301, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %303 = add(%302, meta[relay.Constant][124] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %304 = add(%303, %p137) /* ty=Tensor[(1, 128, 768), float32] */;
    %305 = nn.layer_norm(%304, meta[relay.Constant][125] /* ty=Tensor[(768), float32] */, meta[relay.Constant][126] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 128, 768), float32] */;
    reshape(%305, newshape=[-1, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %464 = %463(%462, %323) /* ty=Tensor[(128, 768), float32] */;
  %465 = fn (%p064: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 3072), float32] {
    %296 = nn.contrib_dense_pack(%p064, meta[relay.Constant][121] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 3072), float32] */;
    %297 = reshape(%296, newshape=[1, 128, 3072]) /* ty=Tensor[(1, 128, 3072), float32] */;
    %298 = add(%297, meta[relay.Constant][122] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 128, 3072), float32] */;
    %299 = fn (%p065: Tensor[(1, 128, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 128, 3072), float32] {
      %292 = multiply(%p065, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 128, 3072), float32] */;
      %293 = erf(%292) /* ty=Tensor[(1, 128, 3072), float32] */;
      %294 = multiply(%293, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 128, 3072), float32] */;
      %295 = add(0.5f /* ty=float32 */, %294) /* ty=Tensor[(1, 128, 3072), float32] */;
      multiply(%p065, %295) /* ty=Tensor[(1, 128, 3072), float32] */
    };
    %300 = %299(%298) /* ty=Tensor[(1, 128, 3072), float32] */;
    reshape(%300, newshape=[-1, 3072]) /* ty=Tensor[(128, 3072), float32] */
  };
  %466 = %465(%464) /* ty=Tensor[(128, 3072), float32] */;
  %467 = fn (%p063: Tensor[(128, 3072), float32], %p136: Tensor[(1, 128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %287 = nn.contrib_dense_pack(%p063, meta[relay.Constant][117] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %288 = reshape(%287, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %289 = add(%288, meta[relay.Constant][118] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %290 = add(%289, %p136) /* ty=Tensor[(1, 128, 768), float32] */;
    %291 = nn.layer_norm(%290, meta[relay.Constant][119] /* ty=Tensor[(768), float32] */, meta[relay.Constant][120] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 128, 768), float32] */;
    reshape(%291, newshape=[-1, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %468 = %467(%466, %305) /* ty=Tensor[(128, 768), float32] */;
  %469 = fn (%p062: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %282 = nn.contrib_dense_pack(%p062, meta[relay.Constant][115] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %283 = reshape(%282, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %284 = add(%283, meta[relay.Constant][116] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %285 = reshape(%284, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %286 = transpose(%285, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%286, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %475 = fn (%p090: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %470 = nn.contrib_dense_pack(%p090, meta[relay.Constant][173] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %471 = reshape(%470, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %472 = add(%471, meta[relay.Constant][174] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %473 = reshape(%472, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %474 = transpose(%473, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%474, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %476 = %469(%468) /* ty=Tensor[(12, 128, 64), float32] */;
  %477 = %475(%468) /* ty=Tensor[(12, 128, 64), float32] */;
  %478 = fn (%p061: Tensor[(12, 128, 64), float32], %p135: Tensor[(12, 128, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 128), float32] {
    %277 = nn.batch_matmul(%p061, %p135, transpose_b=True) /* ty=Tensor[(12, 128, 128), float32] */;
    %278 = reshape(%277, newshape=[1, 12, 128, 128]) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %279 = add(%278, meta[relay.Constant][114] /* ty=Tensor[(1, 1, 1, 128), float32] */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %280 = divide(%279, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %281 = nn.softmax(%280) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    reshape(%281, newshape=[-1, 128, 128]) /* ty=Tensor[(12, 128, 128), float32] */
  };
  %484 = fn (%p091: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 128), float32] {
    %479 = nn.contrib_dense_pack(%p091, meta[relay.Constant][175] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %480 = reshape(%479, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %481 = add(%480, meta[relay.Constant][176] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %482 = reshape(%481, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %483 = transpose(%482, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 128), float32] */;
    reshape(%483, newshape=[-1, 64, 128]) /* ty=Tensor[(12, 64, 128), float32] */
  };
  %485 = %478(%476, %477) /* ty=Tensor[(12, 128, 128), float32] */;
  %486 = %484(%468) /* ty=Tensor[(12, 64, 128), float32] */;
  %487 = fn (%p060: Tensor[(12, 128, 128), float32], %p134: Tensor[(12, 64, 128), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %274 = nn.batch_matmul(%p060, %p134, transpose_b=True) /* ty=Tensor[(12, 128, 64), float32] */;
    %275 = reshape(%274, newshape=[1, 12, 128, 64]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    %276 = transpose(%275, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    reshape(%276, newshape=[128, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %488 = %487(%485, %486) /* ty=Tensor[(128, 768), float32] */;
  %489 = fn (%p059: Tensor[(128, 768), float32], %p133: Tensor[(1, 128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %269 = nn.contrib_dense_pack(%p059, meta[relay.Constant][110] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %270 = reshape(%269, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %271 = add(%270, meta[relay.Constant][111] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %272 = add(%271, %p133) /* ty=Tensor[(1, 128, 768), float32] */;
    %273 = nn.layer_norm(%272, meta[relay.Constant][112] /* ty=Tensor[(768), float32] */, meta[relay.Constant][113] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 128, 768), float32] */;
    reshape(%273, newshape=[-1, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %490 = %489(%488, %291) /* ty=Tensor[(128, 768), float32] */;
  %491 = fn (%p057: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 3072), float32] {
    %264 = nn.contrib_dense_pack(%p057, meta[relay.Constant][108] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 3072), float32] */;
    %265 = reshape(%264, newshape=[1, 128, 3072]) /* ty=Tensor[(1, 128, 3072), float32] */;
    %266 = add(%265, meta[relay.Constant][109] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 128, 3072), float32] */;
    %267 = fn (%p058: Tensor[(1, 128, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 128, 3072), float32] {
      %260 = multiply(%p058, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 128, 3072), float32] */;
      %261 = erf(%260) /* ty=Tensor[(1, 128, 3072), float32] */;
      %262 = multiply(%261, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 128, 3072), float32] */;
      %263 = add(0.5f /* ty=float32 */, %262) /* ty=Tensor[(1, 128, 3072), float32] */;
      multiply(%p058, %263) /* ty=Tensor[(1, 128, 3072), float32] */
    };
    %268 = %267(%266) /* ty=Tensor[(1, 128, 3072), float32] */;
    reshape(%268, newshape=[-1, 3072]) /* ty=Tensor[(128, 3072), float32] */
  };
  %492 = %491(%490) /* ty=Tensor[(128, 3072), float32] */;
  %493 = fn (%p056: Tensor[(128, 3072), float32], %p132: Tensor[(1, 128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %255 = nn.contrib_dense_pack(%p056, meta[relay.Constant][104] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %256 = reshape(%255, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %257 = add(%256, meta[relay.Constant][105] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %258 = add(%257, %p132) /* ty=Tensor[(1, 128, 768), float32] */;
    %259 = nn.layer_norm(%258, meta[relay.Constant][106] /* ty=Tensor[(768), float32] */, meta[relay.Constant][107] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 128, 768), float32] */;
    reshape(%259, newshape=[-1, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %494 = %493(%492, %273) /* ty=Tensor[(128, 768), float32] */;
  %495 = fn (%p055: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %250 = nn.contrib_dense_pack(%p055, meta[relay.Constant][102] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %251 = reshape(%250, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %252 = add(%251, meta[relay.Constant][103] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %253 = reshape(%252, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %254 = transpose(%253, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%254, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %501 = fn (%p092: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %496 = nn.contrib_dense_pack(%p092, meta[relay.Constant][177] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %497 = reshape(%496, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %498 = add(%497, meta[relay.Constant][178] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %499 = reshape(%498, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %500 = transpose(%499, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%500, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %502 = %495(%494) /* ty=Tensor[(12, 128, 64), float32] */;
  %503 = %501(%494) /* ty=Tensor[(12, 128, 64), float32] */;
  %504 = fn (%p054: Tensor[(12, 128, 64), float32], %p131: Tensor[(12, 128, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 128), float32] {
    %245 = nn.batch_matmul(%p054, %p131, transpose_b=True) /* ty=Tensor[(12, 128, 128), float32] */;
    %246 = reshape(%245, newshape=[1, 12, 128, 128]) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %247 = add(%246, meta[relay.Constant][101] /* ty=Tensor[(1, 1, 1, 128), float32] */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %248 = divide(%247, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %249 = nn.softmax(%248) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    reshape(%249, newshape=[-1, 128, 128]) /* ty=Tensor[(12, 128, 128), float32] */
  };
  %510 = fn (%p093: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 128), float32] {
    %505 = nn.contrib_dense_pack(%p093, meta[relay.Constant][179] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %506 = reshape(%505, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %507 = add(%506, meta[relay.Constant][180] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %508 = reshape(%507, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %509 = transpose(%508, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 128), float32] */;
    reshape(%509, newshape=[-1, 64, 128]) /* ty=Tensor[(12, 64, 128), float32] */
  };
  %511 = %504(%502, %503) /* ty=Tensor[(12, 128, 128), float32] */;
  %512 = %510(%494) /* ty=Tensor[(12, 64, 128), float32] */;
  %513 = fn (%p053: Tensor[(12, 128, 128), float32], %p130: Tensor[(12, 64, 128), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %242 = nn.batch_matmul(%p053, %p130, transpose_b=True) /* ty=Tensor[(12, 128, 64), float32] */;
    %243 = reshape(%242, newshape=[1, 12, 128, 64]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    %244 = transpose(%243, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    reshape(%244, newshape=[128, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %514 = %513(%511, %512) /* ty=Tensor[(128, 768), float32] */;
  %515 = fn (%p052: Tensor[(128, 768), float32], %p129: Tensor[(1, 128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %237 = nn.contrib_dense_pack(%p052, meta[relay.Constant][97] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %238 = reshape(%237, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %239 = add(%238, meta[relay.Constant][98] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %240 = add(%239, %p129) /* ty=Tensor[(1, 128, 768), float32] */;
    %241 = nn.layer_norm(%240, meta[relay.Constant][99] /* ty=Tensor[(768), float32] */, meta[relay.Constant][100] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 128, 768), float32] */;
    reshape(%241, newshape=[-1, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %516 = %515(%514, %259) /* ty=Tensor[(128, 768), float32] */;
  %517 = fn (%p050: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 3072), float32] {
    %232 = nn.contrib_dense_pack(%p050, meta[relay.Constant][95] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 3072), float32] */;
    %233 = reshape(%232, newshape=[1, 128, 3072]) /* ty=Tensor[(1, 128, 3072), float32] */;
    %234 = add(%233, meta[relay.Constant][96] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 128, 3072), float32] */;
    %235 = fn (%p051: Tensor[(1, 128, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 128, 3072), float32] {
      %228 = multiply(%p051, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 128, 3072), float32] */;
      %229 = erf(%228) /* ty=Tensor[(1, 128, 3072), float32] */;
      %230 = multiply(%229, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 128, 3072), float32] */;
      %231 = add(0.5f /* ty=float32 */, %230) /* ty=Tensor[(1, 128, 3072), float32] */;
      multiply(%p051, %231) /* ty=Tensor[(1, 128, 3072), float32] */
    };
    %236 = %235(%234) /* ty=Tensor[(1, 128, 3072), float32] */;
    reshape(%236, newshape=[-1, 3072]) /* ty=Tensor[(128, 3072), float32] */
  };
  %518 = %517(%516) /* ty=Tensor[(128, 3072), float32] */;
  %519 = fn (%p049: Tensor[(128, 3072), float32], %p128: Tensor[(1, 128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %223 = nn.contrib_dense_pack(%p049, meta[relay.Constant][91] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %224 = reshape(%223, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %225 = add(%224, meta[relay.Constant][92] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %226 = add(%225, %p128) /* ty=Tensor[(1, 128, 768), float32] */;
    %227 = nn.layer_norm(%226, meta[relay.Constant][93] /* ty=Tensor[(768), float32] */, meta[relay.Constant][94] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 128, 768), float32] */;
    reshape(%227, newshape=[-1, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %520 = %519(%518, %241) /* ty=Tensor[(128, 768), float32] */;
  %521 = fn (%p048: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %218 = nn.contrib_dense_pack(%p048, meta[relay.Constant][89] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %219 = reshape(%218, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %220 = add(%219, meta[relay.Constant][90] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %221 = reshape(%220, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %222 = transpose(%221, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%222, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %527 = fn (%p094: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %522 = nn.contrib_dense_pack(%p094, meta[relay.Constant][181] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %523 = reshape(%522, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %524 = add(%523, meta[relay.Constant][182] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %525 = reshape(%524, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %526 = transpose(%525, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%526, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %528 = %521(%520) /* ty=Tensor[(12, 128, 64), float32] */;
  %529 = %527(%520) /* ty=Tensor[(12, 128, 64), float32] */;
  %530 = fn (%p047: Tensor[(12, 128, 64), float32], %p127: Tensor[(12, 128, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 128), float32] {
    %213 = nn.batch_matmul(%p047, %p127, transpose_b=True) /* ty=Tensor[(12, 128, 128), float32] */;
    %214 = reshape(%213, newshape=[1, 12, 128, 128]) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %215 = add(%214, meta[relay.Constant][88] /* ty=Tensor[(1, 1, 1, 128), float32] */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %216 = divide(%215, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %217 = nn.softmax(%216) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    reshape(%217, newshape=[-1, 128, 128]) /* ty=Tensor[(12, 128, 128), float32] */
  };
  %536 = fn (%p095: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 128), float32] {
    %531 = nn.contrib_dense_pack(%p095, meta[relay.Constant][183] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %532 = reshape(%531, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %533 = add(%532, meta[relay.Constant][184] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %534 = reshape(%533, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %535 = transpose(%534, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 128), float32] */;
    reshape(%535, newshape=[-1, 64, 128]) /* ty=Tensor[(12, 64, 128), float32] */
  };
  %537 = %530(%528, %529) /* ty=Tensor[(12, 128, 128), float32] */;
  %538 = %536(%520) /* ty=Tensor[(12, 64, 128), float32] */;
  %539 = fn (%p046: Tensor[(12, 128, 128), float32], %p126: Tensor[(12, 64, 128), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %210 = nn.batch_matmul(%p046, %p126, transpose_b=True) /* ty=Tensor[(12, 128, 64), float32] */;
    %211 = reshape(%210, newshape=[1, 12, 128, 64]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    %212 = transpose(%211, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    reshape(%212, newshape=[128, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %540 = %539(%537, %538) /* ty=Tensor[(128, 768), float32] */;
  %541 = fn (%p045: Tensor[(128, 768), float32], %p125: Tensor[(1, 128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %205 = nn.contrib_dense_pack(%p045, meta[relay.Constant][84] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %206 = reshape(%205, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %207 = add(%206, meta[relay.Constant][85] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %208 = add(%207, %p125) /* ty=Tensor[(1, 128, 768), float32] */;
    %209 = nn.layer_norm(%208, meta[relay.Constant][86] /* ty=Tensor[(768), float32] */, meta[relay.Constant][87] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 128, 768), float32] */;
    reshape(%209, newshape=[-1, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %542 = %541(%540, %227) /* ty=Tensor[(128, 768), float32] */;
  %543 = fn (%p043: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 3072), float32] {
    %200 = nn.contrib_dense_pack(%p043, meta[relay.Constant][82] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 3072), float32] */;
    %201 = reshape(%200, newshape=[1, 128, 3072]) /* ty=Tensor[(1, 128, 3072), float32] */;
    %202 = add(%201, meta[relay.Constant][83] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 128, 3072), float32] */;
    %203 = fn (%p044: Tensor[(1, 128, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 128, 3072), float32] {
      %196 = multiply(%p044, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 128, 3072), float32] */;
      %197 = erf(%196) /* ty=Tensor[(1, 128, 3072), float32] */;
      %198 = multiply(%197, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 128, 3072), float32] */;
      %199 = add(0.5f /* ty=float32 */, %198) /* ty=Tensor[(1, 128, 3072), float32] */;
      multiply(%p044, %199) /* ty=Tensor[(1, 128, 3072), float32] */
    };
    %204 = %203(%202) /* ty=Tensor[(1, 128, 3072), float32] */;
    reshape(%204, newshape=[-1, 3072]) /* ty=Tensor[(128, 3072), float32] */
  };
  %544 = %543(%542) /* ty=Tensor[(128, 3072), float32] */;
  %545 = fn (%p042: Tensor[(128, 3072), float32], %p124: Tensor[(1, 128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %191 = nn.contrib_dense_pack(%p042, meta[relay.Constant][78] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %192 = reshape(%191, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %193 = add(%192, meta[relay.Constant][79] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %194 = add(%193, %p124) /* ty=Tensor[(1, 128, 768), float32] */;
    %195 = nn.layer_norm(%194, meta[relay.Constant][80] /* ty=Tensor[(768), float32] */, meta[relay.Constant][81] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 128, 768), float32] */;
    reshape(%195, newshape=[-1, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %546 = %545(%544, %209) /* ty=Tensor[(128, 768), float32] */;
  %547 = fn (%p041: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %186 = nn.contrib_dense_pack(%p041, meta[relay.Constant][76] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %187 = reshape(%186, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %188 = add(%187, meta[relay.Constant][77] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %189 = reshape(%188, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %190 = transpose(%189, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%190, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %553 = fn (%p096: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 64), float32] {
    %548 = nn.contrib_dense_pack(%p096, meta[relay.Constant][185] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %549 = reshape(%548, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %550 = add(%549, meta[relay.Constant][186] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %551 = reshape(%550, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %552 = transpose(%551, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    reshape(%552, newshape=[-1, 128, 64]) /* ty=Tensor[(12, 128, 64), float32] */
  };
  %554 = %547(%546) /* ty=Tensor[(12, 128, 64), float32] */;
  %555 = %553(%546) /* ty=Tensor[(12, 128, 64), float32] */;
  %556 = fn (%p040: Tensor[(12, 128, 64), float32], %p123: Tensor[(12, 128, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 128, 128), float32] {
    %181 = nn.batch_matmul(%p040, %p123, transpose_b=True) /* ty=Tensor[(12, 128, 128), float32] */;
    %182 = reshape(%181, newshape=[1, 12, 128, 128]) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %183 = add(%182, meta[relay.Constant][75] /* ty=Tensor[(1, 1, 1, 128), float32] */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %184 = divide(%183, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    %185 = nn.softmax(%184) /* ty=Tensor[(1, 12, 128, 128), float32] */;
    reshape(%185, newshape=[-1, 128, 128]) /* ty=Tensor[(12, 128, 128), float32] */
  };
  %562 = fn (%p097: Tensor[(128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 128), float32] {
    %557 = nn.contrib_dense_pack(%p097, meta[relay.Constant][187] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %558 = reshape(%557, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
    %559 = add(%558, meta[relay.Constant][188] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 128, 768), float32] */;
    %560 = reshape(%559, newshape=[1, 128, 12, 64]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    %561 = transpose(%560, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 128), float32] */;
    reshape(%561, newshape=[-1, 64, 128]) /* ty=Tensor[(12, 64, 128), float32] */
  };
  %563 = %556(%554, %555) /* ty=Tensor[(12, 128, 128), float32] */;
  %564 = %562(%546) /* ty=Tensor[(12, 64, 128), float32] */;
  %565 = fn (%p039: Tensor[(12, 128, 128), float32], %p122: Tensor[(12, 64, 128), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %178 = nn.batch_matmul(%p039, %p122, transpose_b=True) /* ty=Tensor[(12, 128, 64), float32] */;
    %179 = reshape(%178, newshape=[1, 12, 128, 64]) /* ty=Tensor[(1, 12, 128, 64), float32] */;
    %180 = transpose(%179, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 128, 12, 64), float32] */;
    reshape(%180, newshape=[128, 768]) /* ty=Tensor[(128, 768), float32] */
  };
  %566 = %565(%563, %564) /* ty=Tensor[(128, 768), float32] */;
  %567 = fn (%p038: Tensor[(128, 768), float32], %p121: Tensor[(1, 128, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(128, 768), float32] {
    %173 = nn.contrib_dense_pack(%p038, meta[relay.Constant][71] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(128, 768), float32] */;
    %174 = reshape(%173, newshape=[1, 128, 768]) /* ty=Tensor[(1, 128, 768), float32] */;
