def @main(%x: Tensor[(1, 3, 384, 384), float32], weight_layout="NC8n", param_se_scopes=[SEScope(device_type=1, virtual_device_id=0, target=Target(kind='llvm', keys={'cpu'}, attrs={"link-params': (bool)0}, host=Target(kind='llvm', keys={'cpu'}, attrs={"link-params': (bool)0})))], result_se_scope=SEScope(device_type=1, virtual_device_id=0, target=Target(kind='llvm', keys={'cpu'}, attrs={"link-params': (bool)0}, host=Target(kind='llvm', keys={'cpu'}, attrs={"link-params': (bool)0}))), hash="c4a7f5cbc0a227c2", out_layout="NCHW4c", data_layout="NCHW3c", dst_layout="NCHW", kernel_layout="OIHW3i4o", src_layout="NCHW4c") -> Tensor[(1, 1000), float32] {
  %383 = fn (%p086: Tensor[(1, 3, 384, 384), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(1, 577, 768), float32] {
    %374 = layout_transform(%p086, src_layout="NCHW", dst_layout="NCHW3c") /* ty=Tensor[(1, 1, 384, 384, 3), float32] */;
    %375 = nn.contrib_conv2d_NCHWc(%374, meta[relay.Constant][149] /* ty=Tensor[(192, 1, 16, 16, 3, 4), float32] */, strides=[16, 16], padding=[0, 0, 0, 0], channels=768, kernel_size=[16, 16], data_layout="NCHW3c", kernel_layout="OIHW3i4o", out_layout="NCHW4c") /* ty=Tensor[(1, 192, 24, 24, 4), float32] */;
    %376 = add(%375, meta[relay.Constant][150] /* ty=Tensor[(1, 192, 1, 1, 4), float32] */) /* ty=Tensor[(1, 192, 24, 24, 4), float32] */;
    %377 = layout_transform(%376, src_layout="NCHW4c", dst_layout="NCHW") /* ty=Tensor[(1, 768, 24, 24), float32] */;
    %378 = reshape(%377, newshape=[0, 0, -1, 1]) /* ty=Tensor[(1, 768, 576, 1), float32] */;
    %379 = squeeze(%378, axis=[3]) /* ty=Tensor[(1, 768, 576), float32] */;
    %380 = transpose(%379, axes=[0, 2, 1]) /* ty=Tensor[(1, 576, 768), float32] */;
    %381 = add(%380, meta[relay.Constant][151] /* ty=Tensor[(1, 576, 768), float32] */) /* ty=Tensor[(1, 576, 768), float32] */;
    %382 = (meta[relay.Constant][148] /* ty=Tensor[(1, 1, 768), float32] */, %381);
    concatenate(%382, axis=1) /* ty=Tensor[(1, 577, 768), float32] */
  };
  %384 = %383(%x) /* ty=Tensor[(1, 577, 768), float32] */;
  %385 = fn (%p085: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %373 = nn.layer_norm(%p085, meta[relay.Constant][146] /* ty=Tensor[(768), float32] */, meta[relay.Constant][147] /* ty=Tensor[(768), float32] */, epsilon=1e-06f) /* ty=Tensor[(1, 577, 768), float32] */;
    reshape(%373, newshape=[-1, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %386 = %385(%384) /* ty=Tensor[(577, 768), float32] */;
  %387 = fn (%p084: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %368 = nn.contrib_dense_pack(%p084, meta[relay.Constant][144] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %369 = reshape(%368, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %370 = add(%369, meta[relay.Constant][145] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %371 = reshape(%370, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %372 = transpose(%371, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%372, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %393 = fn (%p087: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %388 = nn.contrib_dense_pack(%p087, meta[relay.Constant][152] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %389 = reshape(%388, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %390 = add(%389, meta[relay.Constant][153] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %391 = reshape(%390, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %392 = transpose(%391, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%392, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %394 = %387(%386) /* ty=Tensor[(12, 577, 64), float32] */;
  %395 = %393(%386) /* ty=Tensor[(12, 577, 64), float32] */;
  %396 = fn (%p083: Tensor[(12, 577, 64), float32], %p147: Tensor[(12, 577, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 577), float32] {
    %364 = nn.batch_matmul(%p083, %p147, transpose_b=True) /* ty=Tensor[(12, 577, 577), float32] */;
    %365 = reshape(%364, newshape=[1, 12, 577, 577]) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %366 = divide(%365, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %367 = nn.softmax(%366) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    reshape(%367, newshape=[-1, 577, 577]) /* ty=Tensor[(12, 577, 577), float32] */
  };
  %402 = fn (%p088: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 577), float32] {
    %397 = nn.contrib_dense_pack(%p088, meta[relay.Constant][154] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %398 = reshape(%397, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %399 = add(%398, meta[relay.Constant][155] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %400 = reshape(%399, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %401 = transpose(%400, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 577), float32] */;
    reshape(%401, newshape=[-1, 64, 577]) /* ty=Tensor[(12, 64, 577), float32] */
  };
  %403 = %396(%394, %395) /* ty=Tensor[(12, 577, 577), float32] */;
  %404 = %402(%386) /* ty=Tensor[(12, 64, 577), float32] */;
  %405 = fn (%p082: Tensor[(12, 577, 577), float32], %p146: Tensor[(12, 64, 577), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %361 = nn.batch_matmul(%p082, %p146, transpose_b=True) /* ty=Tensor[(12, 577, 64), float32] */;
    %362 = reshape(%361, newshape=[1, 12, 577, 64]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    %363 = transpose(%362, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    reshape(%363, newshape=[577, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %406 = %405(%403, %404) /* ty=Tensor[(577, 768), float32] */;
  %407 = fn (%p081: Tensor[(577, 768), float32], %p145: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %356 = nn.contrib_dense_pack(%p081, meta[relay.Constant][140] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %357 = reshape(%356, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %358 = add(%357, meta[relay.Constant][141] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %359 = add(%p145, %358) /* ty=Tensor[(1, 577, 768), float32] */;
    %360 = nn.layer_norm(%359, meta[relay.Constant][142] /* ty=Tensor[(768), float32] */, meta[relay.Constant][143] /* ty=Tensor[(768), float32] */, epsilon=1e-06f) /* ty=Tensor[(1, 577, 768), float32] */;
    reshape(%360, newshape=[-1, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %408 = %407(%406, %384) /* ty=Tensor[(577, 768), float32] */;
  %409 = fn (%p079: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 3072), float32] {
    %351 = nn.contrib_dense_pack(%p079, meta[relay.Constant][138] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 3072), float32] */;
    %352 = reshape(%351, newshape=[1, 577, 3072]) /* ty=Tensor[(1, 577, 3072), float32] */;
    %353 = add(%352, meta[relay.Constant][139] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 577, 3072), float32] */;
    %354 = fn (%p080: Tensor[(1, 577, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 577, 3072), float32] {
      %347 = multiply(%p080, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 577, 3072), float32] */;
      %348 = erf(%347) /* ty=Tensor[(1, 577, 3072), float32] */;
      %349 = multiply(%348, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 577, 3072), float32] */;
      %350 = add(0.5f /* ty=float32 */, %349) /* ty=Tensor[(1, 577, 3072), float32] */;
      multiply(%p080, %350) /* ty=Tensor[(1, 577, 3072), float32] */
    };
    %355 = %354(%353) /* ty=Tensor[(1, 577, 3072), float32] */;
    reshape(%355, newshape=[-1, 3072]) /* ty=Tensor[(577, 3072), float32] */
  };
  %410 = %409(%408) /* ty=Tensor[(577, 3072), float32] */;
  %411 = fn (%p078: Tensor[(577, 3072), float32], %p144: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %342 = nn.contrib_dense_pack(%p078, meta[relay.Constant][134] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %343 = reshape(%342, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %344 = add(%343, meta[relay.Constant][135] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %345 = add(%p144, %344) /* ty=Tensor[(1, 577, 768), float32] */;
    %346 = nn.layer_norm(%345, meta[relay.Constant][136] /* ty=Tensor[(768), float32] */, meta[relay.Constant][137] /* ty=Tensor[(768), float32] */, epsilon=1e-06f) /* ty=Tensor[(1, 577, 768), float32] */;
    reshape(%346, newshape=[-1, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %412 = %411(%410, %359) /* ty=Tensor[(577, 768), float32] */;
  %413 = fn (%p077: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %337 = nn.contrib_dense_pack(%p077, meta[relay.Constant][132] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %338 = reshape(%337, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %339 = add(%338, meta[relay.Constant][133] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %340 = reshape(%339, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %341 = transpose(%340, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%341, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %419 = fn (%p089: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %414 = nn.contrib_dense_pack(%p089, meta[relay.Constant][156] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %415 = reshape(%414, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %416 = add(%415, meta[relay.Constant][157] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %417 = reshape(%416, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %418 = transpose(%417, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%418, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %420 = %413(%412) /* ty=Tensor[(12, 577, 64), float32] */;
  %421 = %419(%412) /* ty=Tensor[(12, 577, 64), float32] */;
  %422 = fn (%p076: Tensor[(12, 577, 64), float32], %p143: Tensor[(12, 577, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 577), float32] {
    %333 = nn.batch_matmul(%p076, %p143, transpose_b=True) /* ty=Tensor[(12, 577, 577), float32] */;
    %334 = reshape(%333, newshape=[1, 12, 577, 577]) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %335 = divide(%334, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %336 = nn.softmax(%335) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    reshape(%336, newshape=[-1, 577, 577]) /* ty=Tensor[(12, 577, 577), float32] */
  };
  %428 = fn (%p090: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 577), float32] {
    %423 = nn.contrib_dense_pack(%p090, meta[relay.Constant][158] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %424 = reshape(%423, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %425 = add(%424, meta[relay.Constant][159] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %426 = reshape(%425, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %427 = transpose(%426, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 577), float32] */;
    reshape(%427, newshape=[-1, 64, 577]) /* ty=Tensor[(12, 64, 577), float32] */
  };
  %429 = %422(%420, %421) /* ty=Tensor[(12, 577, 577), float32] */;
  %430 = %428(%412) /* ty=Tensor[(12, 64, 577), float32] */;
  %431 = fn (%p075: Tensor[(12, 577, 577), float32], %p142: Tensor[(12, 64, 577), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %330 = nn.batch_matmul(%p075, %p142, transpose_b=True) /* ty=Tensor[(12, 577, 64), float32] */;
    %331 = reshape(%330, newshape=[1, 12, 577, 64]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    %332 = transpose(%331, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    reshape(%332, newshape=[577, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %432 = %431(%429, %430) /* ty=Tensor[(577, 768), float32] */;
  %433 = fn (%p074: Tensor[(577, 768), float32], %p141: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %325 = nn.contrib_dense_pack(%p074, meta[relay.Constant][128] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %326 = reshape(%325, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %327 = add(%326, meta[relay.Constant][129] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %328 = add(%p141, %327) /* ty=Tensor[(1, 577, 768), float32] */;
    %329 = nn.layer_norm(%328, meta[relay.Constant][130] /* ty=Tensor[(768), float32] */, meta[relay.Constant][131] /* ty=Tensor[(768), float32] */, epsilon=1e-06f) /* ty=Tensor[(1, 577, 768), float32] */;
    reshape(%329, newshape=[-1, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %434 = %433(%432, %345) /* ty=Tensor[(577, 768), float32] */;
  %435 = fn (%p072: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 3072), float32] {
    %320 = nn.contrib_dense_pack(%p072, meta[relay.Constant][126] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 3072), float32] */;
    %321 = reshape(%320, newshape=[1, 577, 3072]) /* ty=Tensor[(1, 577, 3072), float32] */;
    %322 = add(%321, meta[relay.Constant][127] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 577, 3072), float32] */;
    %323 = fn (%p073: Tensor[(1, 577, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 577, 3072), float32] {
      %316 = multiply(%p073, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 577, 3072), float32] */;
      %317 = erf(%316) /* ty=Tensor[(1, 577, 3072), float32] */;
      %318 = multiply(%317, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 577, 3072), float32] */;
      %319 = add(0.5f /* ty=float32 */, %318) /* ty=Tensor[(1, 577, 3072), float32] */;
      multiply(%p073, %319) /* ty=Tensor[(1, 577, 3072), float32] */
    };
    %324 = %323(%322) /* ty=Tensor[(1, 577, 3072), float32] */;
    reshape(%324, newshape=[-1, 3072]) /* ty=Tensor[(577, 3072), float32] */
  };
  %436 = %435(%434) /* ty=Tensor[(577, 3072), float32] */;
  %437 = fn (%p071: Tensor[(577, 3072), float32], %p140: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %311 = nn.contrib_dense_pack(%p071, meta[relay.Constant][122] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %312 = reshape(%311, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %313 = add(%312, meta[relay.Constant][123] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %314 = add(%p140, %313) /* ty=Tensor[(1, 577, 768), float32] */;
    %315 = nn.layer_norm(%314, meta[relay.Constant][124] /* ty=Tensor[(768), float32] */, meta[relay.Constant][125] /* ty=Tensor[(768), float32] */, epsilon=1e-06f) /* ty=Tensor[(1, 577, 768), float32] */;
    reshape(%315, newshape=[-1, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %438 = %437(%436, %328) /* ty=Tensor[(577, 768), float32] */;
  %439 = fn (%p070: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %306 = nn.contrib_dense_pack(%p070, meta[relay.Constant][120] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %307 = reshape(%306, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %308 = add(%307, meta[relay.Constant][121] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %309 = reshape(%308, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %310 = transpose(%309, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%310, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %445 = fn (%p091: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %440 = nn.contrib_dense_pack(%p091, meta[relay.Constant][160] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %441 = reshape(%440, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %442 = add(%441, meta[relay.Constant][161] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %443 = reshape(%442, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %444 = transpose(%443, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%444, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %446 = %439(%438) /* ty=Tensor[(12, 577, 64), float32] */;
  %447 = %445(%438) /* ty=Tensor[(12, 577, 64), float32] */;
  %448 = fn (%p069: Tensor[(12, 577, 64), float32], %p139: Tensor[(12, 577, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 577), float32] {
    %302 = nn.batch_matmul(%p069, %p139, transpose_b=True) /* ty=Tensor[(12, 577, 577), float32] */;
    %303 = reshape(%302, newshape=[1, 12, 577, 577]) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %304 = divide(%303, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %305 = nn.softmax(%304) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    reshape(%305, newshape=[-1, 577, 577]) /* ty=Tensor[(12, 577, 577), float32] */
  };
  %454 = fn (%p092: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 577), float32] {
    %449 = nn.contrib_dense_pack(%p092, meta[relay.Constant][162] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %450 = reshape(%449, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %451 = add(%450, meta[relay.Constant][163] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %452 = reshape(%451, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %453 = transpose(%452, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 577), float32] */;
    reshape(%453, newshape=[-1, 64, 577]) /* ty=Tensor[(12, 64, 577), float32] */
  };
  %455 = %448(%446, %447) /* ty=Tensor[(12, 577, 577), float32] */;
  %456 = %454(%438) /* ty=Tensor[(12, 64, 577), float32] */;
  %457 = fn (%p068: Tensor[(12, 577, 577), float32], %p138: Tensor[(12, 64, 577), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %299 = nn.batch_matmul(%p068, %p138, transpose_b=True) /* ty=Tensor[(12, 577, 64), float32] */;
    %300 = reshape(%299, newshape=[1, 12, 577, 64]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    %301 = transpose(%300, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    reshape(%301, newshape=[577, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %458 = %457(%455, %456) /* ty=Tensor[(577, 768), float32] */;
  %459 = fn (%p067: Tensor[(577, 768), float32], %p137: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %294 = nn.contrib_dense_pack(%p067, meta[relay.Constant][116] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %295 = reshape(%294, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %296 = add(%295, meta[relay.Constant][117] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %297 = add(%p137, %296) /* ty=Tensor[(1, 577, 768), float32] */;
    %298 = nn.layer_norm(%297, meta[relay.Constant][118] /* ty=Tensor[(768), float32] */, meta[relay.Constant][119] /* ty=Tensor[(768), float32] */, epsilon=1e-06f) /* ty=Tensor[(1, 577, 768), float32] */;
    reshape(%298, newshape=[-1, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %460 = %459(%458, %314) /* ty=Tensor[(577, 768), float32] */;
  %461 = fn (%p065: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 3072), float32] {
    %289 = nn.contrib_dense_pack(%p065, meta[relay.Constant][114] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 3072), float32] */;
    %290 = reshape(%289, newshape=[1, 577, 3072]) /* ty=Tensor[(1, 577, 3072), float32] */;
    %291 = add(%290, meta[relay.Constant][115] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 577, 3072), float32] */;
    %292 = fn (%p066: Tensor[(1, 577, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 577, 3072), float32] {
      %285 = multiply(%p066, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 577, 3072), float32] */;
      %286 = erf(%285) /* ty=Tensor[(1, 577, 3072), float32] */;
      %287 = multiply(%286, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 577, 3072), float32] */;
      %288 = add(0.5f /* ty=float32 */, %287) /* ty=Tensor[(1, 577, 3072), float32] */;
      multiply(%p066, %288) /* ty=Tensor[(1, 577, 3072), float32] */
    };
    %293 = %292(%291) /* ty=Tensor[(1, 577, 3072), float32] */;
    reshape(%293, newshape=[-1, 3072]) /* ty=Tensor[(577, 3072), float32] */
  };
  %462 = %461(%460) /* ty=Tensor[(577, 3072), float32] */;
  %463 = fn (%p064: Tensor[(577, 3072), float32], %p136: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %280 = nn.contrib_dense_pack(%p064, meta[relay.Constant][110] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %281 = reshape(%280, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %282 = add(%281, meta[relay.Constant][111] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %283 = add(%p136, %282) /* ty=Tensor[(1, 577, 768), float32] */;
    %284 = nn.layer_norm(%283, meta[relay.Constant][112] /* ty=Tensor[(768), float32] */, meta[relay.Constant][113] /* ty=Tensor[(768), float32] */, epsilon=1e-06f) /* ty=Tensor[(1, 577, 768), float32] */;
    reshape(%284, newshape=[-1, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %464 = %463(%462, %297) /* ty=Tensor[(577, 768), float32] */;
  %465 = fn (%p063: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %275 = nn.contrib_dense_pack(%p063, meta[relay.Constant][108] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %276 = reshape(%275, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %277 = add(%276, meta[relay.Constant][109] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %278 = reshape(%277, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %279 = transpose(%278, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%279, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %471 = fn (%p093: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %466 = nn.contrib_dense_pack(%p093, meta[relay.Constant][164] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %467 = reshape(%466, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %468 = add(%467, meta[relay.Constant][165] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %469 = reshape(%468, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %470 = transpose(%469, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%470, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %472 = %465(%464) /* ty=Tensor[(12, 577, 64), float32] */;
  %473 = %471(%464) /* ty=Tensor[(12, 577, 64), float32] */;
  %474 = fn (%p062: Tensor[(12, 577, 64), float32], %p135: Tensor[(12, 577, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 577), float32] {
    %271 = nn.batch_matmul(%p062, %p135, transpose_b=True) /* ty=Tensor[(12, 577, 577), float32] */;
    %272 = reshape(%271, newshape=[1, 12, 577, 577]) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %273 = divide(%272, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %274 = nn.softmax(%273) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    reshape(%274, newshape=[-1, 577, 577]) /* ty=Tensor[(12, 577, 577), float32] */
  };
  %480 = fn (%p094: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 577), float32] {
    %475 = nn.contrib_dense_pack(%p094, meta[relay.Constant][166] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %476 = reshape(%475, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %477 = add(%476, meta[relay.Constant][167] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %478 = reshape(%477, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %479 = transpose(%478, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 577), float32] */;
    reshape(%479, newshape=[-1, 64, 577]) /* ty=Tensor[(12, 64, 577), float32] */
  };
  %481 = %474(%472, %473) /* ty=Tensor[(12, 577, 577), float32] */;
  %482 = %480(%464) /* ty=Tensor[(12, 64, 577), float32] */;
  %483 = fn (%p061: Tensor[(12, 577, 577), float32], %p134: Tensor[(12, 64, 577), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %268 = nn.batch_matmul(%p061, %p134, transpose_b=True) /* ty=Tensor[(12, 577, 64), float32] */;
    %269 = reshape(%268, newshape=[1, 12, 577, 64]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    %270 = transpose(%269, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    reshape(%270, newshape=[577, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %484 = %483(%481, %482) /* ty=Tensor[(577, 768), float32] */;
  %485 = fn (%p060: Tensor[(577, 768), float32], %p133: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %263 = nn.contrib_dense_pack(%p060, meta[relay.Constant][104] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %264 = reshape(%263, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %265 = add(%264, meta[relay.Constant][105] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %266 = add(%p133, %265) /* ty=Tensor[(1, 577, 768), float32] */;
    %267 = nn.layer_norm(%266, meta[relay.Constant][106] /* ty=Tensor[(768), float32] */, meta[relay.Constant][107] /* ty=Tensor[(768), float32] */, epsilon=1e-06f) /* ty=Tensor[(1, 577, 768), float32] */;
    reshape(%267, newshape=[-1, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %486 = %485(%484, %283) /* ty=Tensor[(577, 768), float32] */;
  %487 = fn (%p058: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 3072), float32] {
    %258 = nn.contrib_dense_pack(%p058, meta[relay.Constant][102] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 3072), float32] */;
    %259 = reshape(%258, newshape=[1, 577, 3072]) /* ty=Tensor[(1, 577, 3072), float32] */;
    %260 = add(%259, meta[relay.Constant][103] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 577, 3072), float32] */;
    %261 = fn (%p059: Tensor[(1, 577, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 577, 3072), float32] {
      %254 = multiply(%p059, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 577, 3072), float32] */;
      %255 = erf(%254) /* ty=Tensor[(1, 577, 3072), float32] */;
      %256 = multiply(%255, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 577, 3072), float32] */;
      %257 = add(0.5f /* ty=float32 */, %256) /* ty=Tensor[(1, 577, 3072), float32] */;
      multiply(%p059, %257) /* ty=Tensor[(1, 577, 3072), float32] */
    };
    %262 = %261(%260) /* ty=Tensor[(1, 577, 3072), float32] */;
    reshape(%262, newshape=[-1, 3072]) /* ty=Tensor[(577, 3072), float32] */
  };
  %488 = %487(%486) /* ty=Tensor[(577, 3072), float32] */;
  %489 = fn (%p057: Tensor[(577, 3072), float32], %p132: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %249 = nn.contrib_dense_pack(%p057, meta[relay.Constant][98] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %250 = reshape(%249, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %251 = add(%250, meta[relay.Constant][99] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %252 = add(%p132, %251) /* ty=Tensor[(1, 577, 768), float32] */;
    %253 = nn.layer_norm(%252, meta[relay.Constant][100] /* ty=Tensor[(768), float32] */, meta[relay.Constant][101] /* ty=Tensor[(768), float32] */, epsilon=1e-06f) /* ty=Tensor[(1, 577, 768), float32] */;
    reshape(%253, newshape=[-1, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %490 = %489(%488, %266) /* ty=Tensor[(577, 768), float32] */;
  %491 = fn (%p056: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %244 = nn.contrib_dense_pack(%p056, meta[relay.Constant][96] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %245 = reshape(%244, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %246 = add(%245, meta[relay.Constant][97] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %247 = reshape(%246, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %248 = transpose(%247, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%248, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %497 = fn (%p095: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %492 = nn.contrib_dense_pack(%p095, meta[relay.Constant][168] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %493 = reshape(%492, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %494 = add(%493, meta[relay.Constant][169] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %495 = reshape(%494, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %496 = transpose(%495, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%496, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %498 = %491(%490) /* ty=Tensor[(12, 577, 64), float32] */;
  %499 = %497(%490) /* ty=Tensor[(12, 577, 64), float32] */;
  %500 = fn (%p055: Tensor[(12, 577, 64), float32], %p131: Tensor[(12, 577, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 577), float32] {
    %240 = nn.batch_matmul(%p055, %p131, transpose_b=True) /* ty=Tensor[(12, 577, 577), float32] */;
    %241 = reshape(%240, newshape=[1, 12, 577, 577]) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %242 = divide(%241, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %243 = nn.softmax(%242) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    reshape(%243, newshape=[-1, 577, 577]) /* ty=Tensor[(12, 577, 577), float32] */
  };
  %506 = fn (%p096: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 577), float32] {
    %501 = nn.contrib_dense_pack(%p096, meta[relay.Constant][170] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %502 = reshape(%501, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %503 = add(%502, meta[relay.Constant][171] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %504 = reshape(%503, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %505 = transpose(%504, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 577), float32] */;
    reshape(%505, newshape=[-1, 64, 577]) /* ty=Tensor[(12, 64, 577), float32] */
  };
  %507 = %500(%498, %499) /* ty=Tensor[(12, 577, 577), float32] */;
  %508 = %506(%490) /* ty=Tensor[(12, 64, 577), float32] */;
  %509 = fn (%p054: Tensor[(12, 577, 577), float32], %p130: Tensor[(12, 64, 577), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %237 = nn.batch_matmul(%p054, %p130, transpose_b=True) /* ty=Tensor[(12, 577, 64), float32] */;
    %238 = reshape(%237, newshape=[1, 12, 577, 64]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    %239 = transpose(%238, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    reshape(%239, newshape=[577, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %510 = %509(%507, %508) /* ty=Tensor[(577, 768), float32] */;
  %511 = fn (%p053: Tensor[(577, 768), float32], %p129: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %232 = nn.contrib_dense_pack(%p053, meta[relay.Constant][92] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %233 = reshape(%232, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %234 = add(%233, meta[relay.Constant][93] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %235 = add(%p129, %234) /* ty=Tensor[(1, 577, 768), float32] */;
    %236 = nn.layer_norm(%235, meta[relay.Constant][94] /* ty=Tensor[(768), float32] */, meta[relay.Constant][95] /* ty=Tensor[(768), float32] */, epsilon=1e-06f) /* ty=Tensor[(1, 577, 768), float32] */;
    reshape(%236, newshape=[-1, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %512 = %511(%510, %252) /* ty=Tensor[(577, 768), float32] */;
  %513 = fn (%p051: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 3072), float32] {
    %227 = nn.contrib_dense_pack(%p051, meta[relay.Constant][90] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 3072), float32] */;
    %228 = reshape(%227, newshape=[1, 577, 3072]) /* ty=Tensor[(1, 577, 3072), float32] */;
    %229 = add(%228, meta[relay.Constant][91] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 577, 3072), float32] */;
    %230 = fn (%p052: Tensor[(1, 577, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 577, 3072), float32] {
      %223 = multiply(%p052, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 577, 3072), float32] */;
      %224 = erf(%223) /* ty=Tensor[(1, 577, 3072), float32] */;
      %225 = multiply(%224, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 577, 3072), float32] */;
      %226 = add(0.5f /* ty=float32 */, %225) /* ty=Tensor[(1, 577, 3072), float32] */;
      multiply(%p052, %226) /* ty=Tensor[(1, 577, 3072), float32] */
    };
    %231 = %230(%229) /* ty=Tensor[(1, 577, 3072), float32] */;
    reshape(%231, newshape=[-1, 3072]) /* ty=Tensor[(577, 3072), float32] */
  };
  %514 = %513(%512) /* ty=Tensor[(577, 3072), float32] */;
  %515 = fn (%p050: Tensor[(577, 3072), float32], %p128: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %218 = nn.contrib_dense_pack(%p050, meta[relay.Constant][86] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %219 = reshape(%218, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %220 = add(%219, meta[relay.Constant][87] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %221 = add(%p128, %220) /* ty=Tensor[(1, 577, 768), float32] */;
    %222 = nn.layer_norm(%221, meta[relay.Constant][88] /* ty=Tensor[(768), float32] */, meta[relay.Constant][89] /* ty=Tensor[(768), float32] */, epsilon=1e-06f) /* ty=Tensor[(1, 577, 768), float32] */;
    reshape(%222, newshape=[-1, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %516 = %515(%514, %235) /* ty=Tensor[(577, 768), float32] */;
  %517 = fn (%p049: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %213 = nn.contrib_dense_pack(%p049, meta[relay.Constant][84] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %214 = reshape(%213, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %215 = add(%214, meta[relay.Constant][85] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %216 = reshape(%215, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %217 = transpose(%216, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%217, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %523 = fn (%p097: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %518 = nn.contrib_dense_pack(%p097, meta[relay.Constant][172] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %519 = reshape(%518, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %520 = add(%519, meta[relay.Constant][173] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %521 = reshape(%520, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %522 = transpose(%521, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%522, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %524 = %517(%516) /* ty=Tensor[(12, 577, 64), float32] */;
  %525 = %523(%516) /* ty=Tensor[(12, 577, 64), float32] */;
  %526 = fn (%p048: Tensor[(12, 577, 64), float32], %p127: Tensor[(12, 577, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 577), float32] {
    %209 = nn.batch_matmul(%p048, %p127, transpose_b=True) /* ty=Tensor[(12, 577, 577), float32] */;
    %210 = reshape(%209, newshape=[1, 12, 577, 577]) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %211 = divide(%210, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %212 = nn.softmax(%211) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    reshape(%212, newshape=[-1, 577, 577]) /* ty=Tensor[(12, 577, 577), float32] */
  };
  %532 = fn (%p098: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 577), float32] {
    %527 = nn.contrib_dense_pack(%p098, meta[relay.Constant][174] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %528 = reshape(%527, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %529 = add(%528, meta[relay.Constant][175] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %530 = reshape(%529, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %531 = transpose(%530, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 577), float32] */;
    reshape(%531, newshape=[-1, 64, 577]) /* ty=Tensor[(12, 64, 577), float32] */
  };
  %533 = %526(%524, %525) /* ty=Tensor[(12, 577, 577), float32] */;
  %534 = %532(%516) /* ty=Tensor[(12, 64, 577), float32] */;
  %535 = fn (%p047: Tensor[(12, 577, 577), float32], %p126: Tensor[(12, 64, 577), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %206 = nn.batch_matmul(%p047, %p126, transpose_b=True) /* ty=Tensor[(12, 577, 64), float32] */;
    %207 = reshape(%206, newshape=[1, 12, 577, 64]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    %208 = transpose(%207, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    reshape(%208, newshape=[577, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %536 = %535(%533, %534) /* ty=Tensor[(577, 768), float32] */;
  %537 = fn (%p046: Tensor[(577, 768), float32], %p125: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %201 = nn.contrib_dense_pack(%p046, meta[relay.Constant][80] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %202 = reshape(%201, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %203 = add(%202, meta[relay.Constant][81] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %204 = add(%p125, %203) /* ty=Tensor[(1, 577, 768), float32] */;
    %205 = nn.layer_norm(%204, meta[relay.Constant][82] /* ty=Tensor[(768), float32] */, meta[relay.Constant][83] /* ty=Tensor[(768), float32] */, epsilon=1e-06f) /* ty=Tensor[(1, 577, 768), float32] */;
    reshape(%205, newshape=[-1, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %538 = %537(%536, %221) /* ty=Tensor[(577, 768), float32] */;
  %539 = fn (%p044: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 3072), float32] {
    %196 = nn.contrib_dense_pack(%p044, meta[relay.Constant][78] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 3072), float32] */;
    %197 = reshape(%196, newshape=[1, 577, 3072]) /* ty=Tensor[(1, 577, 3072), float32] */;
    %198 = add(%197, meta[relay.Constant][79] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 577, 3072), float32] */;
    %199 = fn (%p045: Tensor[(1, 577, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 577, 3072), float32] {
      %192 = multiply(%p045, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 577, 3072), float32] */;
      %193 = erf(%192) /* ty=Tensor[(1, 577, 3072), float32] */;
      %194 = multiply(%193, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 577, 3072), float32] */;
      %195 = add(0.5f /* ty=float32 */, %194) /* ty=Tensor[(1, 577, 3072), float32] */;
      multiply(%p045, %195) /* ty=Tensor[(1, 577, 3072), float32] */
    };
    %200 = %199(%198) /* ty=Tensor[(1, 577, 3072), float32] */;
    reshape(%200, newshape=[-1, 3072]) /* ty=Tensor[(577, 3072), float32] */
  };
  %540 = %539(%538) /* ty=Tensor[(577, 3072), float32] */;
  %541 = fn (%p043: Tensor[(577, 3072), float32], %p124: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %187 = nn.contrib_dense_pack(%p043, meta[relay.Constant][74] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %188 = reshape(%187, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %189 = add(%188, meta[relay.Constant][75] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %190 = add(%p124, %189) /* ty=Tensor[(1, 577, 768), float32] */;
    %191 = nn.layer_norm(%190, meta[relay.Constant][76] /* ty=Tensor[(768), float32] */, meta[relay.Constant][77] /* ty=Tensor[(768), float32] */, epsilon=1e-06f) /* ty=Tensor[(1, 577, 768), float32] */;
    reshape(%191, newshape=[-1, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %542 = %541(%540, %204) /* ty=Tensor[(577, 768), float32] */;
  %543 = fn (%p042: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %182 = nn.contrib_dense_pack(%p042, meta[relay.Constant][72] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %183 = reshape(%182, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %184 = add(%183, meta[relay.Constant][73] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %185 = reshape(%184, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %186 = transpose(%185, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%186, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %549 = fn (%p099: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 64), float32] {
    %544 = nn.contrib_dense_pack(%p099, meta[relay.Constant][176] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %545 = reshape(%544, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %546 = add(%545, meta[relay.Constant][177] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %547 = reshape(%546, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %548 = transpose(%547, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    reshape(%548, newshape=[-1, 577, 64]) /* ty=Tensor[(12, 577, 64), float32] */
  };
  %550 = %543(%542) /* ty=Tensor[(12, 577, 64), float32] */;
  %551 = %549(%542) /* ty=Tensor[(12, 577, 64), float32] */;
  %552 = fn (%p041: Tensor[(12, 577, 64), float32], %p123: Tensor[(12, 577, 64), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 577, 577), float32] {
    %178 = nn.batch_matmul(%p041, %p123, transpose_b=True) /* ty=Tensor[(12, 577, 577), float32] */;
    %179 = reshape(%178, newshape=[1, 12, 577, 577]) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %180 = divide(%179, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    %181 = nn.softmax(%180) /* ty=Tensor[(1, 12, 577, 577), float32] */;
    reshape(%181, newshape=[-1, 577, 577]) /* ty=Tensor[(12, 577, 577), float32] */
  };
  %558 = fn (%p0100: Tensor[(577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(12, 64, 577), float32] {
    %553 = nn.contrib_dense_pack(%p0100, meta[relay.Constant][178] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %554 = reshape(%553, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %555 = add(%554, meta[relay.Constant][179] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %556 = reshape(%555, newshape=[1, 577, 12, 64]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    %557 = transpose(%556, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 577), float32] */;
    reshape(%557, newshape=[-1, 64, 577]) /* ty=Tensor[(12, 64, 577), float32] */
  };
  %559 = %552(%550, %551) /* ty=Tensor[(12, 577, 577), float32] */;
  %560 = %558(%542) /* ty=Tensor[(12, 64, 577), float32] */;
  %561 = fn (%p040: Tensor[(12, 577, 577), float32], %p122: Tensor[(12, 64, 577), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %175 = nn.batch_matmul(%p040, %p122, transpose_b=True) /* ty=Tensor[(12, 577, 64), float32] */;
    %176 = reshape(%175, newshape=[1, 12, 577, 64]) /* ty=Tensor[(1, 12, 577, 64), float32] */;
    %177 = transpose(%176, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 577, 12, 64), float32] */;
    reshape(%177, newshape=[577, 768]) /* ty=Tensor[(577, 768), float32] */
  };
  %562 = %561(%559, %560) /* ty=Tensor[(577, 768), float32] */;
  %563 = fn (%p039: Tensor[(577, 768), float32], %p121: Tensor[(1, 577, 768), float32], Compiler="opu.custom", Primitive=1) -> Tensor[(577, 768), float32] {
    %170 = nn.contrib_dense_pack(%p039, meta[relay.Constant][68] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(577, 768), float32] */;
    %171 = reshape(%170, newshape=[1, 577, 768]) /* ty=Tensor[(1, 577, 768), float32] */;
    %172 = add(%171, meta[relay.Constant][69] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 577, 768), float32] */;
    %173 = add(%p121, %172) /* ty=Tensor[(1, 577, 768), float32] */;
