def @main(%input_ids: Tensor[(1, 14), int64], %attention_mask: Tensor[(1, 14), int64], param_se_scopes=[SEScope(device_type=1, virtual_device_id=0, target=Target(kind='llvm', keys={'cpu'}, attrs={"link-params': (bool)0}, host=Target(kind='llvm', keys={'cpu'}, attrs={"link-params': (bool)0}))), SEScope(device_type=1, virtual_device_id=0, target=Target(kind='llvm', keys={'cpu'}, attrs={"link-params': (bool)0}, host=Target(kind='llvm', keys={'cpu'}, attrs={"link-params': (bool)0})))], result_se_scope=SEScope(device_type=1, virtual_device_id=0, target=Target(kind='llvm', keys={'cpu'}, attrs={"link-params': (bool)0}, host=Target(kind='llvm', keys={'cpu'}, attrs={"link-params': (bool)0}))), hash="ab2927fe1c349cf3", weight_layout="NC8n") -> (Tensor[(1, 14, 768), float32], Tensor[(1, 768), float32]) {
  %320 = cast(%input_ids, dtype="int32") /* ty=Tensor[(1, 14), int32] */;
  %321 = fn (%p073: Tensor[(1, 14), int32], Compiler="opu.embedding", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %318 = take(meta[relay.Constant][120] /* ty=Tensor[(30522, 768), float32] */, %p073, axis=0) /* ty=Tensor[(1, 14, 768), float32] */;
    %319 = add(%318, meta[relay.Constant][121] /* ty=Tensor[(1, 14, 768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    add(%319, meta[relay.Constant][122] /* ty=Tensor[(1, 14, 768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %322 = %321(%320) /* ty=Tensor[(1, 14, 768), float32] */;
  %323 = nn.layer_norm(%322, meta[relay.Constant][123] /* ty=Tensor[(768), float32] */, meta[relay.Constant][124] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */;
  %324 = reshape(%323, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %325 = fn (%p072: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %313 = nn.contrib_dense_pack(%p072, meta[relay.Constant][118] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %314 = reshape(%313, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %315 = add(%314, meta[relay.Constant][119] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %316 = reshape(%315, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %317 = transpose(%316, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%317, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %331 = fn (%p074: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %326 = nn.contrib_dense_pack(%p074, meta[relay.Constant][125] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %327 = reshape(%326, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %328 = add(%327, meta[relay.Constant][126] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %329 = reshape(%328, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %330 = transpose(%329, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%330, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %332 = %325(%324) /* ty=Tensor[(12, 14, 64), float32] */;
  %333 = %331(%324) /* ty=Tensor[(12, 14, 64), float32] */;
  %334 = fn (%p071: Tensor[(12, 14, 64), float32], %p147: Tensor[(12, 14, 64), float32], %p210: Tensor[(1, 1, 1, 14), float32], Compiler="opu.key_value_matmul_softmax", Primitive=1) -> Tensor[(1, 12, 14, 14), float32] {
    %309 = nn.batch_matmul(%p071, %p147, transpose_b=True) /* ty=Tensor[(12, 14, 14), float32] */;
    %310 = reshape(%309, newshape=[1, 12, 14, 14]) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %311 = divide(%310, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %312 = add(%311, %p210) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    nn.softmax(%312) /* ty=Tensor[(1, 12, 14, 14), float32] */
  };
  %340 = fn (%p075: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 64, 14), float32] {
    %335 = nn.contrib_dense_pack(%p075, meta[relay.Constant][127] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %336 = reshape(%335, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %337 = add(%336, meta[relay.Constant][128] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %338 = reshape(%337, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %339 = transpose(%338, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 14), float32] */;
    reshape(%339, newshape=[-1, 64, 14]) /* ty=Tensor[(12, 64, 14), float32] */
  };
  %341 = %334(%332, %333, %25) /* ty=Tensor[(1, 12, 14, 14), float32] */;
  %342 = %340(%324) /* ty=Tensor[(12, 64, 14), float32] */;
  %343 = fn (%p070: Tensor[(1, 12, 14, 14), float32], %p146: Tensor[(12, 64, 14), float32], Compiler="opu.attention", Primitive=1) -> Tensor[(1, 14, 12, 64), float32] {
    %306 = reshape(%p070, newshape=[-1, 14, 14]) /* ty=Tensor[(12, 14, 14), float32] */;
    %307 = nn.batch_matmul(%306, %p146, transpose_b=True) /* ty=Tensor[(12, 14, 64), float32] */;
    %308 = reshape(%307, newshape=[1, 12, 14, 64]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    transpose(%308, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 14, 12, 64), float32] */
  };
  %344 = %343(%341, %342) /* ty=Tensor[(1, 14, 12, 64), float32] */;
  %345 = fn (%p069: Tensor[(1, 14, 12, 64), float32], %p145: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %301 = reshape(%p069, newshape=[14, 768]) /* ty=Tensor[(14, 768), float32] */;
    %302 = nn.contrib_dense_pack(%301, meta[relay.Constant][114] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %303 = reshape(%302, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %304 = add(%303, meta[relay.Constant][115] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %305 = add(%304, %p145) /* ty=Tensor[(1, 14, 768), float32] */;
    nn.layer_norm(%305, meta[relay.Constant][116] /* ty=Tensor[(768), float32] */, meta[relay.Constant][117] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %346 = %345(%344, %323) /* ty=Tensor[(1, 14, 768), float32] */;
  %347 = reshape(%346, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %348 = nn.contrib_dense_pack(%347, meta[relay.Constant][129] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 3072), float32] */;
  %349 = reshape(%348, newshape=[1, 14, 3072]) /* ty=Tensor[(1, 14, 3072), float32] */;
  %350 = add(%349, meta[relay.Constant][130] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 14, 3072), float32] */;
  %351 = fn (%p068: Tensor[(1, 14, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 14, 3072), float32] {
    %297 = multiply(%p068, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %298 = erf(%297) /* ty=Tensor[(1, 14, 3072), float32] */;
    %299 = multiply(%298, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %300 = add(0.5f /* ty=float32 */, %299) /* ty=Tensor[(1, 14, 3072), float32] */;
    multiply(%p068, %300) /* ty=Tensor[(1, 14, 3072), float32] */
  };
  %352 = %351(%350) /* ty=Tensor[(1, 14, 3072), float32] */;
  %353 = fn (%p067: Tensor[(1, 14, 3072), float32], %p144: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %292 = reshape(%p067, newshape=[-1, 3072]) /* ty=Tensor[(14, 3072), float32] */;
    %293 = nn.contrib_dense_pack(%292, meta[relay.Constant][110] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %294 = reshape(%293, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %295 = add(%294, meta[relay.Constant][111] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %296 = add(%295, %p144) /* ty=Tensor[(1, 14, 768), float32] */;
    nn.layer_norm(%296, meta[relay.Constant][112] /* ty=Tensor[(768), float32] */, meta[relay.Constant][113] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %354 = %353(%352, %346) /* ty=Tensor[(1, 14, 768), float32] */;
  %355 = reshape(%354, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %356 = fn (%p066: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %287 = nn.contrib_dense_pack(%p066, meta[relay.Constant][108] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %288 = reshape(%287, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %289 = add(%288, meta[relay.Constant][109] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %290 = reshape(%289, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %291 = transpose(%290, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%291, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %362 = fn (%p076: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %357 = nn.contrib_dense_pack(%p076, meta[relay.Constant][131] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %358 = reshape(%357, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %359 = add(%358, meta[relay.Constant][132] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %360 = reshape(%359, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %361 = transpose(%360, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%361, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %363 = %356(%355) /* ty=Tensor[(12, 14, 64), float32] */;
  %364 = %362(%355) /* ty=Tensor[(12, 14, 64), float32] */;
  %365 = fn (%p065: Tensor[(12, 14, 64), float32], %p143: Tensor[(12, 14, 64), float32], %p29: Tensor[(1, 1, 1, 14), float32], Compiler="opu.key_value_matmul_softmax", Primitive=1) -> Tensor[(1, 12, 14, 14), float32] {
    %283 = nn.batch_matmul(%p065, %p143, transpose_b=True) /* ty=Tensor[(12, 14, 14), float32] */;
    %284 = reshape(%283, newshape=[1, 12, 14, 14]) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %285 = divide(%284, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %286 = add(%285, %p29) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    nn.softmax(%286) /* ty=Tensor[(1, 12, 14, 14), float32] */
  };
  %371 = fn (%p077: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 64, 14), float32] {
    %366 = nn.contrib_dense_pack(%p077, meta[relay.Constant][133] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %367 = reshape(%366, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %368 = add(%367, meta[relay.Constant][134] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %369 = reshape(%368, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %370 = transpose(%369, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 14), float32] */;
    reshape(%370, newshape=[-1, 64, 14]) /* ty=Tensor[(12, 64, 14), float32] */
  };
  %372 = %365(%363, %364, %25) /* ty=Tensor[(1, 12, 14, 14), float32] */;
  %373 = %371(%355) /* ty=Tensor[(12, 64, 14), float32] */;
  %374 = fn (%p064: Tensor[(1, 12, 14, 14), float32], %p142: Tensor[(12, 64, 14), float32], Compiler="opu.attention", Primitive=1) -> Tensor[(1, 14, 12, 64), float32] {
    %280 = reshape(%p064, newshape=[-1, 14, 14]) /* ty=Tensor[(12, 14, 14), float32] */;
    %281 = nn.batch_matmul(%280, %p142, transpose_b=True) /* ty=Tensor[(12, 14, 64), float32] */;
    %282 = reshape(%281, newshape=[1, 12, 14, 64]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    transpose(%282, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 14, 12, 64), float32] */
  };
  %375 = %374(%372, %373) /* ty=Tensor[(1, 14, 12, 64), float32] */;
  %376 = fn (%p063: Tensor[(1, 14, 12, 64), float32], %p141: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %275 = reshape(%p063, newshape=[14, 768]) /* ty=Tensor[(14, 768), float32] */;
    %276 = nn.contrib_dense_pack(%275, meta[relay.Constant][104] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %277 = reshape(%276, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %278 = add(%277, meta[relay.Constant][105] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %279 = add(%278, %p141) /* ty=Tensor[(1, 14, 768), float32] */;
    nn.layer_norm(%279, meta[relay.Constant][106] /* ty=Tensor[(768), float32] */, meta[relay.Constant][107] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %377 = %376(%375, %354) /* ty=Tensor[(1, 14, 768), float32] */;
  %378 = reshape(%377, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %379 = nn.contrib_dense_pack(%378, meta[relay.Constant][135] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 3072), float32] */;
  %380 = reshape(%379, newshape=[1, 14, 3072]) /* ty=Tensor[(1, 14, 3072), float32] */;
  %381 = add(%380, meta[relay.Constant][136] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 14, 3072), float32] */;
  %382 = fn (%p062: Tensor[(1, 14, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 14, 3072), float32] {
    %271 = multiply(%p062, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %272 = erf(%271) /* ty=Tensor[(1, 14, 3072), float32] */;
    %273 = multiply(%272, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %274 = add(0.5f /* ty=float32 */, %273) /* ty=Tensor[(1, 14, 3072), float32] */;
    multiply(%p062, %274) /* ty=Tensor[(1, 14, 3072), float32] */
  };
  %383 = %382(%381) /* ty=Tensor[(1, 14, 3072), float32] */;
  %384 = fn (%p061: Tensor[(1, 14, 3072), float32], %p140: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %266 = reshape(%p061, newshape=[-1, 3072]) /* ty=Tensor[(14, 3072), float32] */;
    %267 = nn.contrib_dense_pack(%266, meta[relay.Constant][100] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %268 = reshape(%267, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %269 = add(%268, meta[relay.Constant][101] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %270 = add(%269, %p140) /* ty=Tensor[(1, 14, 768), float32] */;
    nn.layer_norm(%270, meta[relay.Constant][102] /* ty=Tensor[(768), float32] */, meta[relay.Constant][103] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %385 = %384(%383, %377) /* ty=Tensor[(1, 14, 768), float32] */;
  %386 = reshape(%385, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %387 = fn (%p060: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %261 = nn.contrib_dense_pack(%p060, meta[relay.Constant][98] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %262 = reshape(%261, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %263 = add(%262, meta[relay.Constant][99] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %264 = reshape(%263, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %265 = transpose(%264, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%265, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %393 = fn (%p078: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %388 = nn.contrib_dense_pack(%p078, meta[relay.Constant][137] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %389 = reshape(%388, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %390 = add(%389, meta[relay.Constant][138] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %391 = reshape(%390, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %392 = transpose(%391, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%392, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %394 = %387(%386) /* ty=Tensor[(12, 14, 64), float32] */;
  %395 = %393(%386) /* ty=Tensor[(12, 14, 64), float32] */;
  %396 = fn (%p059: Tensor[(12, 14, 64), float32], %p139: Tensor[(12, 14, 64), float32], %p28: Tensor[(1, 1, 1, 14), float32], Compiler="opu.key_value_matmul_softmax", Primitive=1) -> Tensor[(1, 12, 14, 14), float32] {
    %257 = nn.batch_matmul(%p059, %p139, transpose_b=True) /* ty=Tensor[(12, 14, 14), float32] */;
    %258 = reshape(%257, newshape=[1, 12, 14, 14]) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %259 = divide(%258, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %260 = add(%259, %p28) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    nn.softmax(%260) /* ty=Tensor[(1, 12, 14, 14), float32] */
  };
  %402 = fn (%p079: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 64, 14), float32] {
    %397 = nn.contrib_dense_pack(%p079, meta[relay.Constant][139] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %398 = reshape(%397, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %399 = add(%398, meta[relay.Constant][140] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %400 = reshape(%399, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %401 = transpose(%400, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 14), float32] */;
    reshape(%401, newshape=[-1, 64, 14]) /* ty=Tensor[(12, 64, 14), float32] */
  };
  %403 = %396(%394, %395, %25) /* ty=Tensor[(1, 12, 14, 14), float32] */;
  %404 = %402(%386) /* ty=Tensor[(12, 64, 14), float32] */;
  %405 = fn (%p058: Tensor[(1, 12, 14, 14), float32], %p138: Tensor[(12, 64, 14), float32], Compiler="opu.attention", Primitive=1) -> Tensor[(1, 14, 12, 64), float32] {
    %254 = reshape(%p058, newshape=[-1, 14, 14]) /* ty=Tensor[(12, 14, 14), float32] */;
    %255 = nn.batch_matmul(%254, %p138, transpose_b=True) /* ty=Tensor[(12, 14, 64), float32] */;
    %256 = reshape(%255, newshape=[1, 12, 14, 64]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    transpose(%256, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 14, 12, 64), float32] */
  };
  %406 = %405(%403, %404) /* ty=Tensor[(1, 14, 12, 64), float32] */;
  %407 = fn (%p057: Tensor[(1, 14, 12, 64), float32], %p137: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %249 = reshape(%p057, newshape=[14, 768]) /* ty=Tensor[(14, 768), float32] */;
    %250 = nn.contrib_dense_pack(%249, meta[relay.Constant][94] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %251 = reshape(%250, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %252 = add(%251, meta[relay.Constant][95] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %253 = add(%252, %p137) /* ty=Tensor[(1, 14, 768), float32] */;
    nn.layer_norm(%253, meta[relay.Constant][96] /* ty=Tensor[(768), float32] */, meta[relay.Constant][97] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %408 = %407(%406, %385) /* ty=Tensor[(1, 14, 768), float32] */;
  %409 = reshape(%408, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %410 = nn.contrib_dense_pack(%409, meta[relay.Constant][141] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 3072), float32] */;
  %411 = reshape(%410, newshape=[1, 14, 3072]) /* ty=Tensor[(1, 14, 3072), float32] */;
  %412 = add(%411, meta[relay.Constant][142] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 14, 3072), float32] */;
  %413 = fn (%p056: Tensor[(1, 14, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 14, 3072), float32] {
    %245 = multiply(%p056, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %246 = erf(%245) /* ty=Tensor[(1, 14, 3072), float32] */;
    %247 = multiply(%246, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %248 = add(0.5f /* ty=float32 */, %247) /* ty=Tensor[(1, 14, 3072), float32] */;
    multiply(%p056, %248) /* ty=Tensor[(1, 14, 3072), float32] */
  };
  %414 = %413(%412) /* ty=Tensor[(1, 14, 3072), float32] */;
  %415 = fn (%p055: Tensor[(1, 14, 3072), float32], %p136: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %240 = reshape(%p055, newshape=[-1, 3072]) /* ty=Tensor[(14, 3072), float32] */;
    %241 = nn.contrib_dense_pack(%240, meta[relay.Constant][90] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %242 = reshape(%241, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %243 = add(%242, meta[relay.Constant][91] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %244 = add(%243, %p136) /* ty=Tensor[(1, 14, 768), float32] */;
    nn.layer_norm(%244, meta[relay.Constant][92] /* ty=Tensor[(768), float32] */, meta[relay.Constant][93] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %416 = %415(%414, %408) /* ty=Tensor[(1, 14, 768), float32] */;
  %417 = reshape(%416, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %418 = fn (%p054: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %235 = nn.contrib_dense_pack(%p054, meta[relay.Constant][88] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %236 = reshape(%235, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %237 = add(%236, meta[relay.Constant][89] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %238 = reshape(%237, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %239 = transpose(%238, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%239, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %424 = fn (%p080: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %419 = nn.contrib_dense_pack(%p080, meta[relay.Constant][143] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %420 = reshape(%419, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %421 = add(%420, meta[relay.Constant][144] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %422 = reshape(%421, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %423 = transpose(%422, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%423, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %425 = %418(%417) /* ty=Tensor[(12, 14, 64), float32] */;
  %426 = %424(%417) /* ty=Tensor[(12, 14, 64), float32] */;
  %427 = fn (%p053: Tensor[(12, 14, 64), float32], %p135: Tensor[(12, 14, 64), float32], %p27: Tensor[(1, 1, 1, 14), float32], Compiler="opu.key_value_matmul_softmax", Primitive=1) -> Tensor[(1, 12, 14, 14), float32] {
    %231 = nn.batch_matmul(%p053, %p135, transpose_b=True) /* ty=Tensor[(12, 14, 14), float32] */;
    %232 = reshape(%231, newshape=[1, 12, 14, 14]) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %233 = divide(%232, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %234 = add(%233, %p27) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    nn.softmax(%234) /* ty=Tensor[(1, 12, 14, 14), float32] */
  };
  %433 = fn (%p081: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 64, 14), float32] {
    %428 = nn.contrib_dense_pack(%p081, meta[relay.Constant][145] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %429 = reshape(%428, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %430 = add(%429, meta[relay.Constant][146] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %431 = reshape(%430, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %432 = transpose(%431, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 14), float32] */;
    reshape(%432, newshape=[-1, 64, 14]) /* ty=Tensor[(12, 64, 14), float32] */
  };
  %434 = %427(%425, %426, %25) /* ty=Tensor[(1, 12, 14, 14), float32] */;
  %435 = %433(%417) /* ty=Tensor[(12, 64, 14), float32] */;
  %436 = fn (%p052: Tensor[(1, 12, 14, 14), float32], %p134: Tensor[(12, 64, 14), float32], Compiler="opu.attention", Primitive=1) -> Tensor[(1, 14, 12, 64), float32] {
    %228 = reshape(%p052, newshape=[-1, 14, 14]) /* ty=Tensor[(12, 14, 14), float32] */;
    %229 = nn.batch_matmul(%228, %p134, transpose_b=True) /* ty=Tensor[(12, 14, 64), float32] */;
    %230 = reshape(%229, newshape=[1, 12, 14, 64]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    transpose(%230, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 14, 12, 64), float32] */
  };
  %437 = %436(%434, %435) /* ty=Tensor[(1, 14, 12, 64), float32] */;
  %438 = fn (%p051: Tensor[(1, 14, 12, 64), float32], %p133: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %223 = reshape(%p051, newshape=[14, 768]) /* ty=Tensor[(14, 768), float32] */;
    %224 = nn.contrib_dense_pack(%223, meta[relay.Constant][84] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %225 = reshape(%224, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %226 = add(%225, meta[relay.Constant][85] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %227 = add(%226, %p133) /* ty=Tensor[(1, 14, 768), float32] */;
    nn.layer_norm(%227, meta[relay.Constant][86] /* ty=Tensor[(768), float32] */, meta[relay.Constant][87] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %439 = %438(%437, %416) /* ty=Tensor[(1, 14, 768), float32] */;
  %440 = reshape(%439, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %441 = nn.contrib_dense_pack(%440, meta[relay.Constant][147] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 3072), float32] */;
  %442 = reshape(%441, newshape=[1, 14, 3072]) /* ty=Tensor[(1, 14, 3072), float32] */;
  %443 = add(%442, meta[relay.Constant][148] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 14, 3072), float32] */;
  %444 = fn (%p050: Tensor[(1, 14, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 14, 3072), float32] {
    %219 = multiply(%p050, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %220 = erf(%219) /* ty=Tensor[(1, 14, 3072), float32] */;
    %221 = multiply(%220, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %222 = add(0.5f /* ty=float32 */, %221) /* ty=Tensor[(1, 14, 3072), float32] */;
    multiply(%p050, %222) /* ty=Tensor[(1, 14, 3072), float32] */
  };
  %445 = %444(%443) /* ty=Tensor[(1, 14, 3072), float32] */;
  %446 = fn (%p049: Tensor[(1, 14, 3072), float32], %p132: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %214 = reshape(%p049, newshape=[-1, 3072]) /* ty=Tensor[(14, 3072), float32] */;
    %215 = nn.contrib_dense_pack(%214, meta[relay.Constant][80] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %216 = reshape(%215, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %217 = add(%216, meta[relay.Constant][81] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %218 = add(%217, %p132) /* ty=Tensor[(1, 14, 768), float32] */;
    nn.layer_norm(%218, meta[relay.Constant][82] /* ty=Tensor[(768), float32] */, meta[relay.Constant][83] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %447 = %446(%445, %439) /* ty=Tensor[(1, 14, 768), float32] */;
  %448 = reshape(%447, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %449 = fn (%p048: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %209 = nn.contrib_dense_pack(%p048, meta[relay.Constant][78] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %210 = reshape(%209, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %211 = add(%210, meta[relay.Constant][79] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %212 = reshape(%211, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %213 = transpose(%212, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%213, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %455 = fn (%p082: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %450 = nn.contrib_dense_pack(%p082, meta[relay.Constant][149] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %451 = reshape(%450, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %452 = add(%451, meta[relay.Constant][150] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %453 = reshape(%452, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %454 = transpose(%453, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%454, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %456 = %449(%448) /* ty=Tensor[(12, 14, 64), float32] */;
  %457 = %455(%448) /* ty=Tensor[(12, 14, 64), float32] */;
  %458 = fn (%p047: Tensor[(12, 14, 64), float32], %p131: Tensor[(12, 14, 64), float32], %p26: Tensor[(1, 1, 1, 14), float32], Compiler="opu.key_value_matmul_softmax", Primitive=1) -> Tensor[(1, 12, 14, 14), float32] {
    %205 = nn.batch_matmul(%p047, %p131, transpose_b=True) /* ty=Tensor[(12, 14, 14), float32] */;
    %206 = reshape(%205, newshape=[1, 12, 14, 14]) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %207 = divide(%206, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %208 = add(%207, %p26) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    nn.softmax(%208) /* ty=Tensor[(1, 12, 14, 14), float32] */
  };
  %464 = fn (%p083: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 64, 14), float32] {
    %459 = nn.contrib_dense_pack(%p083, meta[relay.Constant][151] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %460 = reshape(%459, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %461 = add(%460, meta[relay.Constant][152] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %462 = reshape(%461, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %463 = transpose(%462, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 14), float32] */;
    reshape(%463, newshape=[-1, 64, 14]) /* ty=Tensor[(12, 64, 14), float32] */
  };
  %465 = %458(%456, %457, %25) /* ty=Tensor[(1, 12, 14, 14), float32] */;
  %466 = %464(%448) /* ty=Tensor[(12, 64, 14), float32] */;
  %467 = fn (%p046: Tensor[(1, 12, 14, 14), float32], %p130: Tensor[(12, 64, 14), float32], Compiler="opu.attention", Primitive=1) -> Tensor[(1, 14, 12, 64), float32] {
    %202 = reshape(%p046, newshape=[-1, 14, 14]) /* ty=Tensor[(12, 14, 14), float32] */;
    %203 = nn.batch_matmul(%202, %p130, transpose_b=True) /* ty=Tensor[(12, 14, 64), float32] */;
    %204 = reshape(%203, newshape=[1, 12, 14, 64]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    transpose(%204, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 14, 12, 64), float32] */
  };
  %468 = %467(%465, %466) /* ty=Tensor[(1, 14, 12, 64), float32] */;
  %469 = fn (%p045: Tensor[(1, 14, 12, 64), float32], %p129: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %197 = reshape(%p045, newshape=[14, 768]) /* ty=Tensor[(14, 768), float32] */;
    %198 = nn.contrib_dense_pack(%197, meta[relay.Constant][74] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %199 = reshape(%198, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %200 = add(%199, meta[relay.Constant][75] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %201 = add(%200, %p129) /* ty=Tensor[(1, 14, 768), float32] */;
    nn.layer_norm(%201, meta[relay.Constant][76] /* ty=Tensor[(768), float32] */, meta[relay.Constant][77] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %470 = %469(%468, %447) /* ty=Tensor[(1, 14, 768), float32] */;
  %471 = reshape(%470, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %472 = nn.contrib_dense_pack(%471, meta[relay.Constant][153] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 3072), float32] */;
  %473 = reshape(%472, newshape=[1, 14, 3072]) /* ty=Tensor[(1, 14, 3072), float32] */;
  %474 = add(%473, meta[relay.Constant][154] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 14, 3072), float32] */;
  %475 = fn (%p044: Tensor[(1, 14, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 14, 3072), float32] {
    %193 = multiply(%p044, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %194 = erf(%193) /* ty=Tensor[(1, 14, 3072), float32] */;
    %195 = multiply(%194, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %196 = add(0.5f /* ty=float32 */, %195) /* ty=Tensor[(1, 14, 3072), float32] */;
    multiply(%p044, %196) /* ty=Tensor[(1, 14, 3072), float32] */
  };
  %476 = %475(%474) /* ty=Tensor[(1, 14, 3072), float32] */;
  %477 = fn (%p043: Tensor[(1, 14, 3072), float32], %p128: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %188 = reshape(%p043, newshape=[-1, 3072]) /* ty=Tensor[(14, 3072), float32] */;
    %189 = nn.contrib_dense_pack(%188, meta[relay.Constant][70] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %190 = reshape(%189, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %191 = add(%190, meta[relay.Constant][71] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %192 = add(%191, %p128) /* ty=Tensor[(1, 14, 768), float32] */;
    nn.layer_norm(%192, meta[relay.Constant][72] /* ty=Tensor[(768), float32] */, meta[relay.Constant][73] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %478 = %477(%476, %470) /* ty=Tensor[(1, 14, 768), float32] */;
  %479 = reshape(%478, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %480 = fn (%p042: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %183 = nn.contrib_dense_pack(%p042, meta[relay.Constant][68] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %184 = reshape(%183, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %185 = add(%184, meta[relay.Constant][69] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %186 = reshape(%185, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %187 = transpose(%186, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%187, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %486 = fn (%p084: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %481 = nn.contrib_dense_pack(%p084, meta[relay.Constant][155] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %482 = reshape(%481, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %483 = add(%482, meta[relay.Constant][156] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %484 = reshape(%483, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %485 = transpose(%484, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%485, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %487 = %480(%479) /* ty=Tensor[(12, 14, 64), float32] */;
  %488 = %486(%479) /* ty=Tensor[(12, 14, 64), float32] */;
  %489 = fn (%p041: Tensor[(12, 14, 64), float32], %p127: Tensor[(12, 14, 64), float32], %p25: Tensor[(1, 1, 1, 14), float32], Compiler="opu.key_value_matmul_softmax", Primitive=1) -> Tensor[(1, 12, 14, 14), float32] {
    %179 = nn.batch_matmul(%p041, %p127, transpose_b=True) /* ty=Tensor[(12, 14, 14), float32] */;
    %180 = reshape(%179, newshape=[1, 12, 14, 14]) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %181 = divide(%180, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %182 = add(%181, %p25) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    nn.softmax(%182) /* ty=Tensor[(1, 12, 14, 14), float32] */
  };
  %495 = fn (%p085: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 64, 14), float32] {
    %490 = nn.contrib_dense_pack(%p085, meta[relay.Constant][157] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %491 = reshape(%490, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %492 = add(%491, meta[relay.Constant][158] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %493 = reshape(%492, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %494 = transpose(%493, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 14), float32] */;
    reshape(%494, newshape=[-1, 64, 14]) /* ty=Tensor[(12, 64, 14), float32] */
  };
  %496 = %489(%487, %488, %25) /* ty=Tensor[(1, 12, 14, 14), float32] */;
  %497 = %495(%479) /* ty=Tensor[(12, 64, 14), float32] */;
  %498 = fn (%p040: Tensor[(1, 12, 14, 14), float32], %p126: Tensor[(12, 64, 14), float32], Compiler="opu.attention", Primitive=1) -> Tensor[(1, 14, 12, 64), float32] {
    %176 = reshape(%p040, newshape=[-1, 14, 14]) /* ty=Tensor[(12, 14, 14), float32] */;
    %177 = nn.batch_matmul(%176, %p126, transpose_b=True) /* ty=Tensor[(12, 14, 64), float32] */;
    %178 = reshape(%177, newshape=[1, 12, 14, 64]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    transpose(%178, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 14, 12, 64), float32] */
  };
  %499 = %498(%496, %497) /* ty=Tensor[(1, 14, 12, 64), float32] */;
  %500 = fn (%p039: Tensor[(1, 14, 12, 64), float32], %p125: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %171 = reshape(%p039, newshape=[14, 768]) /* ty=Tensor[(14, 768), float32] */;
    %172 = nn.contrib_dense_pack(%171, meta[relay.Constant][64] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %173 = reshape(%172, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %174 = add(%173, meta[relay.Constant][65] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %175 = add(%174, %p125) /* ty=Tensor[(1, 14, 768), float32] */;
    nn.layer_norm(%175, meta[relay.Constant][66] /* ty=Tensor[(768), float32] */, meta[relay.Constant][67] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %501 = %500(%499, %478) /* ty=Tensor[(1, 14, 768), float32] */;
  %502 = reshape(%501, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %503 = nn.contrib_dense_pack(%502, meta[relay.Constant][159] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 3072), float32] */;
  %504 = reshape(%503, newshape=[1, 14, 3072]) /* ty=Tensor[(1, 14, 3072), float32] */;
  %505 = add(%504, meta[relay.Constant][160] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 14, 3072), float32] */;
  %506 = fn (%p038: Tensor[(1, 14, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 14, 3072), float32] {
    %167 = multiply(%p038, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %168 = erf(%167) /* ty=Tensor[(1, 14, 3072), float32] */;
    %169 = multiply(%168, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %170 = add(0.5f /* ty=float32 */, %169) /* ty=Tensor[(1, 14, 3072), float32] */;
    multiply(%p038, %170) /* ty=Tensor[(1, 14, 3072), float32] */
  };
  %507 = %506(%505) /* ty=Tensor[(1, 14, 3072), float32] */;
  %508 = fn (%p037: Tensor[(1, 14, 3072), float32], %p124: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %162 = reshape(%p037, newshape=[-1, 3072]) /* ty=Tensor[(14, 3072), float32] */;
    %163 = nn.contrib_dense_pack(%162, meta[relay.Constant][60] /* ty=Tensor[(96, 3072, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %164 = reshape(%163, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %165 = add(%164, meta[relay.Constant][61] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %166 = add(%165, %p124) /* ty=Tensor[(1, 14, 768), float32] */;
    nn.layer_norm(%166, meta[relay.Constant][62] /* ty=Tensor[(768), float32] */, meta[relay.Constant][63] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %509 = %508(%507, %501) /* ty=Tensor[(1, 14, 768), float32] */;
  %510 = reshape(%509, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %511 = fn (%p036: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %157 = nn.contrib_dense_pack(%p036, meta[relay.Constant][58] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %158 = reshape(%157, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %159 = add(%158, meta[relay.Constant][59] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %160 = reshape(%159, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %161 = transpose(%160, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%161, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %517 = fn (%p086: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 14, 64), float32] {
    %512 = nn.contrib_dense_pack(%p086, meta[relay.Constant][161] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %513 = reshape(%512, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %514 = add(%513, meta[relay.Constant][162] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %515 = reshape(%514, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %516 = transpose(%515, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    reshape(%516, newshape=[-1, 14, 64]) /* ty=Tensor[(12, 14, 64), float32] */
  };
  %518 = %511(%510) /* ty=Tensor[(12, 14, 64), float32] */;
  %519 = %517(%510) /* ty=Tensor[(12, 14, 64), float32] */;
  %520 = fn (%p035: Tensor[(12, 14, 64), float32], %p123: Tensor[(12, 14, 64), float32], %p24: Tensor[(1, 1, 1, 14), float32], Compiler="opu.key_value_matmul_softmax", Primitive=1) -> Tensor[(1, 12, 14, 14), float32] {
    %153 = nn.batch_matmul(%p035, %p123, transpose_b=True) /* ty=Tensor[(12, 14, 14), float32] */;
    %154 = reshape(%153, newshape=[1, 12, 14, 14]) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %155 = divide(%154, 8f /* ty=float32 */) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    %156 = add(%155, %p24) /* ty=Tensor[(1, 12, 14, 14), float32] */;
    nn.softmax(%156) /* ty=Tensor[(1, 12, 14, 14), float32] */
  };
  %526 = fn (%p087: Tensor[(14, 768), float32], Compiler="opu.linear", Primitive=1) -> Tensor[(12, 64, 14), float32] {
    %521 = nn.contrib_dense_pack(%p087, meta[relay.Constant][163] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %522 = reshape(%521, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %523 = add(%522, meta[relay.Constant][164] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %524 = reshape(%523, newshape=[1, 14, 12, 64]) /* ty=Tensor[(1, 14, 12, 64), float32] */;
    %525 = transpose(%524, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 14), float32] */;
    reshape(%525, newshape=[-1, 64, 14]) /* ty=Tensor[(12, 64, 14), float32] */
  };
  %527 = %520(%518, %519, %25) /* ty=Tensor[(1, 12, 14, 14), float32] */;
  %528 = %526(%510) /* ty=Tensor[(12, 64, 14), float32] */;
  %529 = fn (%p034: Tensor[(1, 12, 14, 14), float32], %p122: Tensor[(12, 64, 14), float32], Compiler="opu.attention", Primitive=1) -> Tensor[(1, 14, 12, 64), float32] {
    %150 = reshape(%p034, newshape=[-1, 14, 14]) /* ty=Tensor[(12, 14, 14), float32] */;
    %151 = nn.batch_matmul(%150, %p122, transpose_b=True) /* ty=Tensor[(12, 14, 64), float32] */;
    %152 = reshape(%151, newshape=[1, 12, 14, 64]) /* ty=Tensor[(1, 12, 14, 64), float32] */;
    transpose(%152, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 14, 12, 64), float32] */
  };
  %530 = %529(%527, %528) /* ty=Tensor[(1, 14, 12, 64), float32] */;
  %531 = fn (%p033: Tensor[(1, 14, 12, 64), float32], %p121: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %145 = reshape(%p033, newshape=[14, 768]) /* ty=Tensor[(14, 768), float32] */;
    %146 = nn.contrib_dense_pack(%145, meta[relay.Constant][54] /* ty=Tensor[(96, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 768), float32] */;
    %147 = reshape(%146, newshape=[1, 14, 768]) /* ty=Tensor[(1, 14, 768), float32] */;
    %148 = add(%147, meta[relay.Constant][55] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(1, 14, 768), float32] */;
    %149 = add(%148, %p121) /* ty=Tensor[(1, 14, 768), float32] */;
    nn.layer_norm(%149, meta[relay.Constant][56] /* ty=Tensor[(768), float32] */, meta[relay.Constant][57] /* ty=Tensor[(768), float32] */, epsilon=1e-12f) /* ty=Tensor[(1, 14, 768), float32] */
  };
  %532 = %531(%530, %509) /* ty=Tensor[(1, 14, 768), float32] */;
  %533 = reshape(%532, newshape=[-1, 768]) /* ty=Tensor[(14, 768), float32] */;
  %534 = nn.contrib_dense_pack(%533, meta[relay.Constant][165] /* ty=Tensor[(384, 768, 8), float32] */, units=None, out_dtype="float32", weight_layout="NC8n") /* ty=Tensor[(14, 3072), float32] */;
  %535 = reshape(%534, newshape=[1, 14, 3072]) /* ty=Tensor[(1, 14, 3072), float32] */;
  %536 = add(%535, meta[relay.Constant][166] /* ty=Tensor[(3072), float32] */) /* ty=Tensor[(1, 14, 3072), float32] */;
  %537 = fn (%p032: Tensor[(1, 14, 3072), float32], Compiler="opu.gelu", Primitive=1) -> Tensor[(1, 14, 3072), float32] {
    %141 = multiply(%p032, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %142 = erf(%141) /* ty=Tensor[(1, 14, 3072), float32] */;
    %143 = multiply(%142, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 14, 3072), float32] */;
    %144 = add(0.5f /* ty=float32 */, %143) /* ty=Tensor[(1, 14, 3072), float32] */;
    multiply(%p032, %144) /* ty=Tensor[(1, 14, 3072), float32] */
  };
  %538 = %537(%536) /* ty=Tensor[(1, 14, 3072), float32] */;
  %539 = fn (%p031: Tensor[(1, 14, 3072), float32], %p120: Tensor[(1, 14, 768), float32], Compiler="opu.mlp", Primitive=1) -> Tensor[(1, 14, 768), float32] {
    %136 = reshape(%p031, newshape=[-1, 3072]) /* ty=Tensor[(14, 3072), float32] */;
